// Возвращает тип конфликта несовместимых требований.
//
// Возвращаемое значение:
//   Строка - Тип конфликта.
Функция НесовместимыеТребования() Экспорт

	Возврат "НесовместимыеТребования";

КонецФункции

// Возвращает тип конфликта неустановленной транзитивной зависимости.
//
// Возвращаемое значение:
//   Строка - Тип конфликта.
Функция ТранзитивнаяЗависимостьНеУстановлена() Экспорт

	Возврат "ТранзитивнаяЗависимостьНеУстановлена";

КонецФункции

// Возвращает тип конфликта несоответствия установленной версии требованию.
//
// Возвращаемое значение:
//   Строка - Тип конфликта.
Функция УстановленнаяВерсияНеСоответствуетТребованию() Экспорт

	Возврат "УстановленнаяВерсияНеСоответствуетТребованию";

КонецФункции
