#Использовать jason

// Формирует JSON-отчет об изменениях зависимостей.
//
// Параметры:
//   ИзмененияЗависимостей - ТаблицаЗначений - см. ЗависимостиПакета.ПолучитьИзмененияОтносительно
//
// Возвращаемое значение:
//   Строка - JSON-отчет.
Функция Сформировать(ИзмененияЗависимостей) Экспорт
	
	Сериализатор = Новый СериализаторJson();
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, Символы.Таб);
	Возврат Сериализатор.Сериализовать(ПодготовитьТаблицуИзменений(ИзмененияЗависимостей), ПараметрыЗаписиJSON);

КонецФункции

Функция ПодготовитьТаблицуИзменений(ИзмененияЗависимостей)

	Результат = Новый Массив();
	Для Каждого СтрокаТаблицы Из ИзмененияЗависимостей Цикл
		
		СравнениеВерсий = Новый СравнениеВерсийЗависимостиJson;
		СравнениеВерсий.ИмяПакета = СтрокаТаблицы.ИмяПакета;
		СравнениеВерсий.ДляРазработки = СтрокаТаблицы.ДляРазработки;
		СравнениеВерсий.ТекущаяМинимальнаяВерсия = СтрокаТаблицы.МинимальнаяВерсияДо;
		СравнениеВерсий.ЦелеваяМинимальнаяВерсия = СтрокаТаблицы.МинимальнаяВерсияПосле;
		СравнениеВерсий.МаксимальнаяВерсия = СтрокаТаблицы.МаксимальнаяВерсия;

		Результат.Добавить(СравнениеВерсий);

	КонецЦикла;

	Возврат Результат;
	
КонецФункции
