#Использовать errors
#Использовать native-errors

#Область ОбработчикиСобытий

&Дуб
Процедура ПриСозданииОбъекта()

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Создает классификатор нативных ошибок.
//
// Возвращаемое значение:
//   КлассификаторОшибок - Настроенный классификатор нативных ошибок.
&Завязь(Значение = "КлассификаторНативныхОшибок", Тип = "КлассификаторОшибок")
Функция КлассификаторНативныхОшибок() Экспорт

	Классификатор = Новый КлассификаторОшибок;
	Классификатор.ДобавитьПоставщикаПравил(Тип("ПравилаНативныхОшибок"));

	Возврат Классификатор;

КонецФункции

#КонецОбласти
