#Использовать errors

#Область ОписаниеПеременных

Перем _НастройкиРеестраПакетов; // НастройкиРеестраПакетов
Перем _ОпределительАдаптера; // ОпределительАдаптераРеестра
Перем _Лог; // Лог

#КонецОбласти

#Область ОбработчикиСобытий

// Создает клиент реестра пакетов.
//
// Параметры:
//   НастройкиРеестраПакетов - НастройкиРеестраПакетов - Настройки адресов и подключения к реестру.
//   ОпределительАдаптера    - ОпределительАдаптераРеестра - Определитель API реестра.
&Желудь
Процедура ПриСозданииОбъекта(
	&Пластилин("НастройкиРеестраПакетов") НастройкиРеестраПакетов,
	&Пластилин("ОпределительАдаптераРеестра") ОпределительАдаптера
)

	_НастройкиРеестраПакетов = НастройкиРеестраПакетов;
	_ОпределительАдаптера = ОпределительАдаптера;
	_Лог = Логирование.ПолучитьЛог("oscript.lib.depos");

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Получает версии пакета из реестра.
//
// Параметры:
//   ИмяПакета - Строка - Имя пакета.
//
// Возвращаемое значение:
//   Массив из Строка - Корректные semver-версии или пустой массив, если пакет не найден.
//
// Исключения:
//   - registry.hosts_not_configured - Если не настроен реестр.
//   - registry.unavailable - Если реестр не вернул корректные версии.
Функция ПолучитьВерсии(ИмяПакета) Экспорт

	Реестр = _НастройкиРеестраПакетов.Реестр();
	Прокси = _НастройкиРеестраПакетов.Прокси();

	ПроверитьНаличиеРеестра(Реестр);

	ПредставлениеРеестра = Реестр.ВСтроку();

	_Лог.Отладка("Получение версий пакета '%1' из реестра: %2", ИмяПакета, ПредставлениеРеестра);

	Адаптер = _ОпределительАдаптера.Получить(ИмяПакета, Реестр, Прокси);
	ВерсииПакета = Адаптер.ПолучитьВерсии(ИмяПакета, Реестр, Прокси);

	Если ВерсииПакета.Количество() = 0 Тогда
		_Лог.Предупреждение(
			"Пакет '%1' не найден в реестре %2, пакет пропущен",
			ИмяПакета,
			ПредставлениеРеестра
		);
		Возврат ВерсииПакета;
	КонецЕсли;

	_Лог.Отладка(
		"Успешно получено %1 версий пакета '%2' из реестра: %3",
		ВерсииПакета.Количество(),
		ИмяПакета,
		ПредставлениеРеестра
	);

	Возврат ВерсииПакета;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеРеестра(Реестр)

	Если Реестр <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	Ошибка = Новый ПостроительОшибки(
		КодыОшибокDepos.ХостыРеестраНеНастроены(),
		"Не настроен адрес реестра пакетов"
	)
		.Подсказка("Задайте ОсновнойРеестр в настройках depos.")
		.Построить();

	ВызватьИсключение Ошибка;

КонецПроцедуры

#КонецОбласти
