// BSLLS:ExportVariables-off

&Деталька(Значение = "depos.registry.url", ЗначениеПоУмолчанию = "https://hub.oscript.io")
Перем ОсновнойРеестр Экспорт; // Строка

&Деталька(Значение = "depos.registry.proxy", ЗначениеПоУмолчанию = "")
Перем ПроксиРеестра Экспорт; // Строка

&Деталька(Значение = "depos.debug", ЗначениеПоУмолчанию = Ложь)
Перем РежимОтладки Экспорт; // Булево

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Возвращает признак включенного режима отладки.
//
// Возвращаемое значение:
//   Булево - Истина, если режим отладки включен.
Функция РежимОтладкиВключен() Экспорт

	Если ТипЗнч(РежимОтладки) = Тип("Булево") Тогда
		Возврат РежимОтладки;
	КонецЕсли;

	Возврат НРег(СокрЛП(Строка(РежимОтладки))) = "true";

КонецФункции

#КонецОбласти
