// BSLLS:ExportVariables-off

#Область ОписаниеПеременных

Перем ПутьКМанифесту Экспорт; // Строка
Перем КоличествоПроблем Экспорт; // Число
Перем КоличествоРекомендаций Экспорт; // Число
Перем Секции Экспорт; // Массив

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()

	ПутьКМанифесту = "";
	КоличествоПроблем = 0;
	КоличествоРекомендаций = 0;
	Секции = Новый Массив();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет, содержит ли отчёт хотя бы одну проблему.
//
// Возвращаемое значение:
//   Булево
Функция ЕстьПроблемы() Экспорт

	Возврат КоличествоПроблем > 0;

КонецФункции

#КонецОбласти
