// BSLLS:ExportVariables-off

#Область ОписаниеПеременных

&Сериализуемое("number")
&Тип("Строка")
Перем Номер Экспорт; // Строка

&Сериализуемое("type")
&Тип("Строка")
Перем Тип Экспорт; // Строка

&Сериализуемое("title")
&Тип("Строка")
Перем Заголовок Экспорт; // Строка

&Сериализуемое("description")
&Тип("Строка")
Перем Описание Экспорт; // Строка

&Сериализуемое("items")
&Тип("Массив") &ДляКаждого &Тип("ДиагностическийЭлементЗависимости")
Перем Элементы Экспорт; // Массив из ДиагностическийЭлементЗависимости

#КонецОбласти

#Область ОбработчикиСобытий

// Создает секцию отчета диагностики.
//
// Параметры:
//   Номер - Строка - Номер секции в отчете.
//   Тип - Строка - Тип диагностических элементов.
//   Заголовок - Строка - Заголовок секции.
//   Описание - Строка - Пояснение к секции.
//   Элементы - Массив - Диагностические элементы секции.
Процедура ПриСозданииОбъекта(
	Номер = "",
	Тип = "",
	Заголовок = "",
	Описание = "",
	Элементы = Неопределено
)

	Если Элементы = Неопределено Тогда
		Элементы = Новый Массив();
	КонецЕсли;

	ЭтотОбъект.Номер = Номер;
	ЭтотОбъект.Тип = Тип;
	ЭтотОбъект.Заголовок = Заголовок;
	ЭтотОбъект.Описание = Описание;
	ЭтотОбъект.Элементы = Элементы;

КонецПроцедуры

#КонецОбласти
