#Использовать 1connector

#Область ОбработчикиСобытий

// HTTP-транспорт реестра пакетов.
&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выполняет GET-запрос к реестру пакетов.
//
// Параметры:
//   Адрес  - URL - Адрес ресурса.
//   Прокси - URL, Неопределено - Адрес proxy.
//
// Возвращаемое значение:
//   Структура:
//     * КодСостояния - Число - Код состояния HTTP.
//     * Тело         - Строка - Тело HTTP-ответа.
//
// Исключения:
//   Исключение транспорта 1connector при невозможности выполнить запрос.
Функция Получить(Адрес, Прокси) Экспорт

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Таймаут", 30);

	Если Прокси <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("Прокси", СоздатьИнтернетПрокси(Прокси));
	КонецЕсли;

	Ответ = КоннекторHTTP.Get(Адрес.КодированноеПредставление(), Неопределено, ДополнительныеПараметры);

	Возврат Новый Структура("КодСостояния,Тело", Ответ.КодСостояния, Ответ.Текст());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьИнтернетПрокси(Адрес)

	Прокси = Новый ИнтернетПрокси;

	Для Каждого Протокол Из СтрРазделить("http,https", ",") Цикл
		Если Адрес.ИмяПользователя() <> Неопределено Тогда
			Прокси.Установить(
				Протокол,
				Адрес.Хост(),
				Адрес.ЭффективныйПорт(),
				Адрес.ИмяПользователя(),
				Адрес.Пароль(),
				Ложь
			);
		Иначе
			Прокси.Установить(Протокол, Адрес.Хост(), Адрес.ЭффективныйПорт());
		КонецЕсли;
	КонецЦикла;

	Возврат Прокси;

КонецФункции

#КонецОбласти
