#Область ОписаниеПеременных

Перем _Лог; // Лог, Неопределено

#КонецОбласти

#Область ОбработчикиСобытий

&Желудь
Процедура ПриСозданииОбъекта()

	_Лог = Логирование.ПолучитьЛог("oscript.lib.depos");

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Прочитать(ПутьКФайлу, ТекстОшибки) Экспорт

	ЧтениеТекста = Неопределено;
	Попытка
		ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
		СодержимоеФайла = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
		Возврат СодержимоеФайла;
	Исключение
		ИнформацияОбОшибкеЧтения = ИнформацияОбОшибке();
		ЗакрытьЧтениеТекста(ЧтениеТекста);
		ОтладитьОшибку(ИнформацияОбОшибкеЧтения);
		ВызватьИсключение СтрШаблон("%1: %2", ТекстОшибки, КраткоеПредставлениеОшибки(ИнформацияОбОшибкеЧтения));
	КонецПопытки;

КонецФункции

Процедура Записать(ПутьКФайлу, СодержимоеФайла, ТекстОшибки) Экспорт

	ЗаписьТекста = Неопределено;
	Попытка
		ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, "UTF-8");
		ЗаписьТекста.Записать(СодержимоеФайла);
		ЗаписьТекста.Закрыть();
	Исключение
		ИнформацияОбОшибкеЗаписи = ИнформацияОбОшибке();
		ЗакрытьЗаписьТекста(ЗаписьТекста);
		ОтладитьОшибку(ИнформацияОбОшибкеЗаписи);
		ВызватьИсключение СтрШаблон("%1: %2", ТекстОшибки, КраткоеПредставлениеОшибки(ИнформацияОбОшибкеЗаписи));
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗакрытьЧтениеТекста(ЧтениеТекста)

	Если ЧтениеТекста = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ЧтениеТекста.Закрыть();
	Исключение
		ОтладитьСообщение("Не удалось закрыть файл: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Процедура ЗакрытьЗаписьТекста(ЗаписьТекста)

	Если ЗаписьТекста = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ЗаписьТекста.Закрыть();
	Исключение
		ОтладитьСообщение("Не удалось закрыть файл после записи: %1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Процедура ОтладитьОшибку(ИнформацияОбОшибкеЗаписи)

	Если _Лог = Неопределено Тогда
		Возврат;
	КонецЕсли;

	_Лог.Отладка(ПодробноеПредставлениеОшибки(ИнформацияОбОшибкеЗаписи));

КонецПроцедуры

Процедура ОтладитьСообщение(ШаблонСообщения, Параметр1 = Неопределено)

	Если _Лог = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Параметр1 = Неопределено Тогда
		_Лог.Отладка(ШаблонСообщения);
	Иначе
		_Лог.Отладка(ШаблонСообщения, Параметр1);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
