#Использовать errors

// Записывает изменения зависимостей в файл указанного формата.
//
// Параметры:
//   ИзмененияЗависимостей - ТаблицаЗначений - см. ЗависимостиПакета.ПолучитьИзмененияОтносительно
//   ПолноеИмяФайла - Строка - Полный путь к файлу, в который производится запись.
//                             Расширение файла определяет формат вывода.
//
// Исключения:
//   - Вызывается исключение при указании неподдерживаемого расширения файла
//   - Возможны исключения при ошибках записи в файл
Процедура Записать(ИзмененияЗависимостей, ПолноеИмяФайла) Экспорт

	Расширение = Сред(НРег(Новый Файл(ПолноеИмяФайла).Расширение), 2);

	Если Расширение = "json" Тогда
		Экспортер = Новый ЭкспортерИзмененийЗависимостейJson();
	Иначе
		Сообщение = СтрШаблон("Формат '.%1' не поддерживается", Расширение);
		Ошибка = Новый ПостроительОшибки(КодыОшибокDepos.ФорматВыводаНеПоддерживается(), Сообщение)
			.Данные("ПутьКФайлу", ПолноеИмяФайла)
			.Подсказка("Укажите файл с расширением '.json'.")
			.Построить();
		ВызватьИсключение Ошибка;
	КонецЕсли;

	Экспортер.Записать(ИзмененияЗависимостей, ПолноеИмяФайла);

КонецПроцедуры
