#Использовать autumn
#Использовать autumn-cli
#Использовать asserts
#Использовать "../src/core"
#Использовать "../src/cmd"
#Использовать "helpers"
#Использовать "mocks"

Перем Поделка;
Перем ПотокВывода;
Перем ТекущийКаталог;

&Инициализация
Процедура Инициализация() Экспорт
	ТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

&Перед
Процедура ПередКаждым() Экспорт
	ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт
	ПомощникТестирования.ВернутьПотокВывода();
	УстановитьТекущийКаталог(ТекущийКаталог);
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводЗависимостейПереданномуМанифесту() Экспорт

	// Подготовка
	ОжидаемыйВывод =
	" annotations       1.3.0 → 1.3.1
	| asserts           *     → 1.5.0
	| autumn            3.2.0 → 4.3.11
	| delegate          1.0.0 → 1.0.0
	| packageinfo       0.7   → 0.8
	| 1testrunner  dev  1.9.0 → 1.9.2";

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--packagedef");
	ПараметрыКоманды.Добавить("./tests/fixtures/packagedef-another");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводЗависимостейПоМанифестуВТекущемКаталоге() Экспорт

	// Подготовка
	ОжидаемыйВывод =
	" annotations       1.3.0 → 1.3.1
	| asserts           *     → 1.5.0
	| autumn            3.2.0 → 4.3.11
	| delegate          1.0.0 → 1.0.0
	| packageinfo       0.7   → 0.8
	| 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводТолькоУстаревшихЗависимостей() Экспорт

	// Подготовка
	ОжидаемыйВывод =
	" annotations       1.3.0 → 1.3.1
	| autumn            3.2.0 → 4.3.11
	| packageinfo       0.7   → 0.8
	| 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-d");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводЗависимостейСПоследнимиВерсиями() Экспорт

	// Подготовка
	ОжидаемыйВывод =
	" annotations       1.3.0 → 1.3.1
	| asserts           *     → 1.5.0
	| autumn            3.2.0 → 4.3.11
	| delegate          1.0.0 → 1.0.0
	| packageinfo       0.7   → 0.8
	| 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-t");
	ПараметрыКоманды.Добавить("latest");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводЗависимостейСМинорнымиВерсиями() Экспорт

	// Подготовка
	ОжидаемыйВывод = 
	" annotations       1.3.0 → 1.3.1
	| asserts           *     → 1.5.0
	| autumn            3.2.0 → 3.3.0
	| delegate          1.0.0 → 1.0.0
	| packageinfo       0.7   → 0.8
	| 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-t");
	ПараметрыКоманды.Добавить("minor");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводЗависимостейСПатчВерсиями() Экспорт

	// Подготовка
	ОжидаемыйВывод = 
	" annotations       1.3.0 → 1.3.1
	| asserts           *     → 1.5.0
	| autumn            3.2.0 → 3.2.0
	| delegate          1.0.0 → 1.0.0
	| packageinfo       0.7   → 0.7
	| 1testrunner  dev  1.8.0 → 1.8.0";

	УстановитьТекущийКаталог("./tests/fixtures");

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-t");
	ПараметрыКоманды.Добавить("patch");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводЗависимостейПоФильтру() Экспорт

	// Подготовка
	ОжидаемыйВывод = 
	" annotations       1.3.0 → 1.3.1
	| asserts           *     → 1.5.0
	| autumn            3.2.0 → 4.3.11";

	УстановитьТекущийКаталог("./tests/fixtures");

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-f");
	ПараметрыКоманды.Добавить("a*");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВыводТекстаНеНайденыЗависимости() Экспорт

	// Подготовка
	ОжидаемыйВывод = "Не найдены зависимости по заданным условиям";

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--packagedef");
	ПараметрыКоманды.Добавить("./tests/fixtures/packagedef-no-deps");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры