#Использовать "helpers"

&Тест
Процедура ТестДолжен_ВернутьВсеТипыДиагностикиФункциями() Экспорт

	// Действие и Проверка
	Ожидаем.Что(ТипыДиагностикиЗависимостей.ОтсутствуетВМанифесте()).Равно("ОтсутствуетВМанифесте");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.НеИспользуетсяНапрямую()).Равно("НеИспользуетсяНапрямую");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.НеУстановлен()).Равно("НеУстановлен");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.Поврежден()).Равно("Поврежден");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.НесоответствиеВерсий()).Равно("НесоответствиеВерсий");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.НесовместимостьВерсийДвижка())
		.Равно("НесовместимостьВерсийДвижка");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.ТранзитивныйКонфликт()).Равно("ТранзитивныйКонфликт");
	Ожидаем.Что(ТипыДиагностикиЗависимостей.РекомендацияВерсии()).Равно("РекомендацияВерсии");

КонецПроцедуры
