// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

&Тест
Процедура ТестДолжен_СовпадатьСМаскойИмениПакета() Экспорт

	Фильтр = Новый ФильтрИменПакетов("a*s, delegate");

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("delegate")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("autumn")).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СовпадатьСРегулярнымВыражениемИмениПакета() Экспорт

	Фильтр = Новый ФильтрИменПакетов("/(ass.*|d)/");

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("delegate")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("autumn")).ЭтоЛожь();

КонецПроцедуры
