// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

Перем _Поделка; // Поделка

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение(".\src", ".\tests")
&ИсточникЗначение("./src", "./tests")
Процедура ТестДолжен_ОбработатьКроссплатформенныеКаталогиИсходников(
	КаталогИсходников,
	КаталогДляРазработки
) Экспорт

	// Подготовка
	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников(КаталогИсходников)
		.КаталогиДляРазработки(КаталогДляРазработки);
	Зависимости = ПолучитьЗависимостиПоУмолчанию();

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);

	// Проверка
	Ожидаем.Что(Результат).Заполнено();

КонецПроцедуры

&ПередВсеми
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиОтсутствующиеВМанифестеПакеты() Экспорт
	
	// Подготовка
	ТестовыеСлучаи = ПустаяТаблицаТестовыхСлучаев();
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_src_tests", Ложь, 1);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_src_missing_tests", Ложь, 1);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "missing_manifests_present_src_tests", Ложь, 2);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "missing_manifests_present_src_tests", Истина, 1);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "missing_manifests_present_src", Ложь, 1);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "missing_manifests_present_tests", Истина, 1);

	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src")
		.КаталогиДляРазработки("tests");

	Зависимости = ПолучитьЗависимостиПоУмолчанию();

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);
	Пакеты = Результат.Элементы(ТипыДиагностикиЗависимостей.ОтсутствуетВМанифесте());

	// Проверка
	Ожидаем.Что(Пакеты, "Количество отсутствующих пакетов").ИмеетДлину(ТестовыеСлучаи.Количество());

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Представление = СтрШаблон("Имя=%1, ДляРазработки=%2", 
			ТестовыйСлучай.ИмяПакета, ТестовыйСлучай.ДляРазработки);

		НайденныеСтроки = ПроверкаДиагностики.НайтиПакеты(
			Пакеты, ТестовыйСлучай.ИмяПакета, ТестовыйСлучай.ДляРазработки);

		Ожидаем.Что(НайденныеСтроки, "Должен быть найден 1 отсутствующий пакет: " + Представление).ИмеетДлину(1);
		Ожидаем.Что(НайденныеСтроки[0].Файлы, "Количество файлов для " + Представление)
			.ИмеетДлину(ТестовыйСлучай.КоличествоФайлов);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьВерсиюУстановленногоОтсутствующегоПакета() Экспорт

	// Подготовка
	ИмяПакета = "present_in_prod_src_tests";
	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src");
	Зависимости = ПолучитьЗависимостиПоУмолчанию().УдалитьПоИмени(ИмяПакета);

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);
	Пакеты = ПроверкаДиагностики.НайтиПакеты(
		Результат.Элементы(ТипыДиагностикиЗависимостей.ОтсутствуетВМанифесте()),
		ИмяПакета
	);

	// Проверка
	Ожидаем.Что(Пакеты).ИмеетДлину(1);
	Ожидаем.Что(Пакеты[0].УстановленнаяВерсия).Равно("1.0.0");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеИспользоватьУстановленныеПакетыПредыдущейПроверки() Экспорт

	// Подготовка
	ИмяПакета = "present_in_prod_src_tests";
	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src");
	Зависимости = ПолучитьЗависимостиПоУмолчанию();
	ЗависимостиБезПакета = Новый ЗависимостиПакета()
		.ЗаполнитьИзТаблицы(Зависимости.СкопироватьВТаблицу())
		.УдалитьПоИмени(ИмяПакета);

	// Действие
	Анализатор.ПроверитьЗависимости(Зависимости, Новый ВыборПроверокЗависимостей("installed"));
	Результат = Анализатор.ПроверитьЗависимости(
		ЗависимостиБезПакета,
		Новый ВыборПроверокЗависимостей("usage")
	);
	Пакеты = ПроверкаДиагностики.НайтиПакеты(
		Результат.Элементы(ТипыДиагностикиЗависимостей.ОтсутствуетВМанифесте()),
		ИмяПакета
	);

	// Проверка
	Ожидаем.Что(Пакеты).ИмеетДлину(1);
	Ожидаем.Что(Пакеты[0].УстановленнаяВерсия).Равно("");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИсключитьИспользуемыйПакетДоПроверкиМанифеста() Экспорт

	// Подготовка
	ИмяИсключенногоПакета = "missing_manifests_present_src";
	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src")
		.ИсключитьПоИмени(ИмяИсключенногоПакета);
	ВыборПроверок = Новый ВыборПроверокЗависимостей("usage");

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(ПолучитьЗависимостиПоУмолчанию(), ВыборПроверок);

	// Проверка
	ИсключенныеПакеты = ПроверкаДиагностики.НайтиПакеты(
		Результат.Элементы(ТипыДиагностикиЗависимостей.ОтсутствуетВМанифесте()), ИмяИсключенногоПакета);
	Ожидаем.Что(ИсключенныеПакеты).ИмеетДлину(0);
	Ожидаем.Что(Результат.Элементы(ТипыДиагностикиЗависимостей.ОтсутствуетВМанифесте())).ИмеетДлину(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИсключитьОбъявленныйПакетИзАнализа() Экспорт

	// Подготовка
	ИмяИсключенногоПакета = "present_in_prod_missing_src_tests";
	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src")
		.ИсключитьПоИмени(ИмяИсключенногоПакета);
	ВыборПроверок = Новый ВыборПроверокЗависимостей("usage");

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(ПолучитьЗависимостиПоУмолчанию(), ВыборПроверок);

	// Проверка
	ИсключенныеПакеты = ПроверкаДиагностики.НайтиПакеты(
		Результат.Элементы(ТипыДиагностикиЗависимостей.НеИспользуетсяНапрямую()), ИмяИсключенногоПакета);
	Ожидаем.Что(ИсключенныеПакеты).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиНеиспользуемыеПакеты() Экспорт
	
	// Подготовка
	ТестовыеСлучаи = ПустаяТаблицаТестовыхСлучаев();
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_tests_missing_src", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_missing_src_tests", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_src_missing_tests", Истина);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_missing_src_tests", Истина);

	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src")
		.КаталогиДляРазработки("tests");

	Зависимости = ПолучитьЗависимостиПоУмолчанию();
	
	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);
	Пакеты = Результат.Элементы(ТипыДиагностикиЗависимостей.НеИспользуетсяНапрямую());

	// Проверка
	Ожидаем.Что(Пакеты, "Количество неиспользуемых пакетов").ИмеетДлину(ТестовыеСлучаи.Количество());

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Представление = СтрШаблон(
			"Имя=%1, ДляРазработки=%2", 
			ТестовыйСлучай.ИмяПакета,
			ТестовыйСлучай.ДляРазработки
		);

		НайденныеСтроки = ПроверкаДиагностики.НайтиПакеты(
			Пакеты, ТестовыйСлучай.ИмяПакета, ТестовыйСлучай.ДляРазработки);

		Ожидаем.Что(НайденныеСтроки, "Должен быть найден 1 неиспользуемый пакет: " + Представление).ИмеетДлину(1);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиНеиспользуемыеПакетыСРабочимКаталогомСОтносительнымиПутями() Экспорт
	
	// Подготовка
	ТестовыеСлучаи = ПустаяТаблицаТестовыхСлучаев();
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_tests_missing_src", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_missing_src_tests", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_src_missing_tests", Истина);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_missing_src_tests", Истина);

	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src")
		.КаталогиДляРазработки("tests");

	Зависимости = ПолучитьЗависимостиПоУмолчанию();
	
	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);
	Пакеты = Результат.Элементы(ТипыДиагностикиЗависимостей.НеИспользуетсяНапрямую());

	// Проверка
	Ожидаем.Что(Пакеты, "Количество неиспользуемых пакетов").ИмеетДлину(ТестовыеСлучаи.Количество());

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Представление = СтрШаблон(
			"Имя=%1, ДляРазработки=%2", 
			ТестовыйСлучай.ИмяПакета,
			ТестовыйСлучай.ДляРазработки
		);

		НайденныеСтроки = ПроверкаДиагностики.НайтиПакеты(
			Пакеты, ТестовыйСлучай.ИмяПакета, ТестовыйСлучай.ДляРазработки);

		Ожидаем.Что(НайденныеСтроки, "Должен быть найден 1 неиспользуемый пакет: " + Представление).ИмеетДлину(1);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиНеиспользуемыеПакетыБезРабочегоКаталогаСАбсолютнымиПутями() Экспорт
	
	// Подготовка
	ТестовыеСлучаи = ПустаяТаблицаТестовыхСлучаев();
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_tests_missing_src", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_missing_src_tests", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_src_missing_tests", Истина);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_dev_missing_src_tests", Истина);

	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.КаталогиИсходников("./tests/fixtures/ПроектДляАнализа/src")
		.КаталогиДляРазработки("./tests/fixtures/ПроектДляАнализа/tests");

	Зависимости = ПолучитьЗависимостиПоУмолчанию();

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);
	Пакеты = Результат.Элементы(ТипыДиагностикиЗависимостей.НеИспользуетсяНапрямую());

	// Проверка
	Ожидаем.Что(Пакеты, "Количество неиспользуемых пакетов").ИмеетДлину(ТестовыеСлучаи.Количество());

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Представление = СтрШаблон(
			"Имя=%1, ДляРазработки=%2", 
			ТестовыйСлучай.ИмяПакета,
			ТестовыйСлучай.ДляРазработки
		);

		НайденныеСтроки = ПроверкаДиагностики.НайтиПакеты(
			Пакеты, ТестовыйСлучай.ИмяПакета, ТестовыйСлучай.ДляРазработки);

		Ожидаем.Что(НайденныеСтроки, "Должен быть найден 1 неиспользуемый пакет: " + Представление).ИмеетДлину(1);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьИсключениеПакетовДляРазработки() Экспорт
	
	// Подготовка
	ТестовыеСлучаи = ПустаяТаблицаТестовыхСлучаев();
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_tests_missing_src", Ложь);
	ДобавитьТестовыйСлучай(ТестовыеСлучаи, "present_in_prod_missing_src_tests", Ложь);

	Анализатор = _Поделка.НайтиЖелудь("АнализаторЗависимостей")
		.РабочийКаталог("./tests/fixtures/ПроектДляАнализа")
		.КаталогиИсходников("src")
		.КаталогиДляРазработки("tests")
		.ИсключатьДляРазработки();

	Зависимости = ПолучитьЗависимостиПоУмолчанию();
	
	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Зависимости);
	Пакеты = Результат.Элементы(ТипыДиагностикиЗависимостей.НеИспользуетсяНапрямую());

	// Проверка
	Ожидаем.Что(Пакеты, "Количество неиспользуемых пакетов").ИмеетДлину(ТестовыеСлучаи.Количество());

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Представление = СтрШаблон(
			"Имя=%1, ДляРазработки=%2", 
			ТестовыйСлучай.ИмяПакета,
			ТестовыйСлучай.ДляРазработки
		);

		НайденныеСтроки = ПроверкаДиагностики.НайтиПакеты(
			Пакеты, ТестовыйСлучай.ИмяПакета, ТестовыйСлучай.ДляРазработки);

		Ожидаем.Что(НайденныеСтроки, "Должен быть найден 1 неиспользуемый пакет: " + Представление).ИмеетДлину(1);

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗависимостиПоУмолчанию()
	Возврат Новый ЗависимостиПакета().ЗаполнитьИзМанифеста("./tests/fixtures/ПроектДляАнализа/packagedef");
КонецФункции

Функция ПустаяТаблицаТестовыхСлучаев()

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("ИмяПакета");
	Таблица.Колонки.Добавить("ДляРазработки");
	Таблица.Колонки.Добавить("КоличествоФайлов");

	Возврат Таблица;

КонецФункции

Процедура ДобавитьТестовыйСлучай(Таблица, ИмяПакета, ДляРазработки, КоличествоФайлов = Неопределено)

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяПакета = ИмяПакета;
	СтрокаТаблицы.ДляРазработки = ДляРазработки;
	СтрокаТаблицы.КоличествоФайлов = КоличествоФайлов;

КонецПроцедуры
