#Использовать autumn
#Использовать asserts
#Использовать fs
#Использовать "../src/core"
#Использовать "../src/internal"

Перем _ТекущийКаталог; // Строка
Перем _ПеременныеСредыКонфигурация; // Строка

&Инициализация
Процедура Инициализация() Экспорт
	_ТекущийКаталог = ТекущийКаталог();
	_ПеременныеСредыКонфигурация = ПолучитьПеременнуюСреды("OSCRIPT_CONFIG");
КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт
	УстановитьТекущийКаталог(_ТекущийКаталог);
	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", _ПеременныеСредыКонфигурация);
КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиПакеты() Экспорт

	// Подготовка
	УстановитьТекущийКаталог("./tests");

	КаталогБиблиотек1 = "../tests/fixtures/lib_sets/lib1";
	КаталогБиблиотек2 = "../tests/fixtures/lib_sets/lib2";

	ТестовыеСлучаи = Новый ТаблицаЗначений();
	ТестовыеСлучаи.Колонки.Добавить("ПеременнаяСреды_ОсновноеКаталог");
	ТестовыеСлучаи.Колонки.Добавить("ПеременнаяСреды_ДополнительныйКаталог");
	ТестовыеСлучаи.Колонки.Добавить("КаталогБиблиотек");
	ТестовыеСлучаи.Колонки.Добавить("Пакеты");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		КаталогБиблиотек1, 
		"", 
		"",
		"lib1/fs;lib1/package1;lib3/package3");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		"", 
		КаталогБиблиотек2, 
		"",
		"oscript_modules/autumn;lib2/fs;lib2/package2");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		КаталогБиблиотек1, 
		КаталогБиблиотек2, 
		"",
		"lib1/package1;lib2/fs;lib2/package2");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		"", 
		"", 
		"",
		"oscript_modules/autumn;oscript_modules/fs;lib3/package3");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		"", 
		"", 
		КаталогБиблиотек2,
		"oscript_modules/autumn;lib2/fs;lib2/package2");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		КаталогБиблиотек1, 
		"", 
		КаталогБиблиотек2,
		"lib1/package1;lib2/fs;lib2/package2;lib3/package3");

	ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
		"", 
		КаталогБиблиотек1, 
		КаталогБиблиотек2,
		"oscript_modules/autumn;lib1/package1;lib2/fs;lib2/package2");

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл
		
		ОписаниеТеста = СтрШаблон(
			"ПеременнаяСреды_ОсновноеКаталог=%1
			|ПеременнаяСреды_ДополнительныйКаталог=%2
			|КаталогБиблиотек=%3",
			ТестовыйСлучай.ПеременнаяСреды_ОсновноеКаталог,
			ТестовыйСлучай.ПеременнаяСреды_ДополнительныйКаталог,
			ТестовыйСлучай.КаталогБиблиотек
		);

		УстановитьКаталогиБиблиотекВПеременнуюСреды(
			ТестовыйСлучай.ПеременнаяСреды_ОсновноеКаталог, 
			ТестовыйСлучай.ПеременнаяСреды_ДополнительныйКаталог);

		Сканер = Новый СканерУстановленныхПакетов();
		Сканер.УстановитьКаталогБиблиотек(ТестовыйСлучай.КаталогБиблиотек);

		// Действие
		Результат = Сканер.НайтиВсеПакеты();

		// Утверждение
		Для Каждого Пакет Из ТестовыйСлучай.Пакеты Цикл

			ИмяКаталога = Пакет.ИмяКаталога;
			ИмяПакета = Пакет.ИмяПакета;
			Сообщение = СтрШаблон("%1
				|ИмяКаталога=%2
				|ИмяПакета=%3",
				ОписаниеТеста,
				ИмяКаталога,
				ИмяПакета
			);

			Ожидаем.Что(Строка(Результат[ИмяПакета]), Сообщение).Содержит(ИмяКаталога);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьТестовыйСлучай(ТестовыеСлучаи, 
	ПеременнаяСреды_ОсновноеКаталог, ПеременнаяСреды_ДополнительныйКаталог, КаталогБиблиотек, Пакеты)

	ТестовыйСлучай = ТестовыеСлучаи.Добавить();
	ТестовыйСлучай.ПеременнаяСреды_ОсновноеКаталог = ПеременнаяСреды_ОсновноеКаталог;
	ТестовыйСлучай.ПеременнаяСреды_ДополнительныйКаталог = ПеременнаяСреды_ДополнительныйКаталог;
	ТестовыйСлучай.КаталогБиблиотек = КаталогБиблиотек;
	ТестовыйСлучай.Пакеты = Новый Массив();

	Для Каждого Строка Из СтрРазделить(Пакеты, ";") Цикл
		Части = СтрРазделить(Строка, "/");
		ТестовыйСлучай.Пакеты.Добавить(Новый Структура("ИмяКаталога, ИмяПакета", Части[0], Части[1]));
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьКаталогиБиблиотекВПеременнуюСреды(ОсновнойКаталог = "", ДополнительныйКаталог = "")
	
	Параметры = Новый Массив();

	Если ЗначениеЗаполнено(ОсновнойКаталог) Тогда
		Параметры.Добавить("lib.system=" + ОсновнойКаталог);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДополнительныйКаталог) Тогда
		Параметры.Добавить("lib.additional=" + ДополнительныйКаталог);
	КонецЕсли;

	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", СтрСоединить(Параметры, ";"));

КонецПроцедуры