#Использовать "helpers"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("0.0.0")
&ИсточникЗначение("1.2.3")
&ИсточникЗначение("1.2.3-alpha")
&ИсточникЗначение("1.2.3-alpha.1")
&ИсточникЗначение("1.2.3+build.5")
&ИсточникЗначение("1.2.3-alpha.1+build.5")
Процедура ТестДолжен_ИзвлечьСтрогуюВерсиюSemVer(Версия) Экспорт

	// Подготовка
	Парсер = Новый ПарсерСтраницыПакета;

	// Действие
	ИзвлеченныеВерсии = Парсер.ИзвлечьВерсии(СтраницаСВерсией(Версия));

	// Проверка
	Ожидаем.Что(ИзвлеченныеВерсии).ИмеетДлину(1);
	Ожидаем.Что(ИзвлеченныеВерсии[0]).Равно(Версия);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("1")
&ИсточникЗначение("1.2")
&ИсточникЗначение("01.2.3")
&ИсточникЗначение("1.2.3-01")
&ИсточникЗначение("v1.2.3")
Процедура ТестДолжен_ПропуститьНестрогуюВерсиюSemVer(Версия) Экспорт

	// Подготовка
	Парсер = Новый ПарсерСтраницыПакета;

	// Действие
	ИзвлеченныеВерсии = Парсер.ИзвлечьВерсии(СтраницаСВерсией(Версия));

	// Проверка
	Ожидаем.Что(ИзвлеченныеВерсии).ИмеетДлину(0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтраницаСВерсией(Версия)

	Ссылка = СтрШаблон("<a href=""/download/autumn/autumn-%1.ospx"">%1</a>", Версия);
	Возврат "<html>" + Ссылка + "</html>";

КонецФункции

#КонецОбласти
