#Использовать "helpers"

#Область Тесты

&Тест
Процедура ТестДолжен_ОтклонитьНеподдерживаемыйФорматВыводаСтруктурированнойОшибкой() Экспорт

	// Подготовка
	Экспортер = Новый ЭкспортерИзмененийЗависимостей();
	ПутьКФайлу = "changes.xml";

	Параметры = Новый Массив();
	Параметры.Добавить(Новый ТаблицаЗначений());
	Параметры.Добавить(ПутьКФайлу);

	// Действие и Проверка
	Ожидаем.Что(Экспортер)
		.Метод("Записать", Параметры)
		.ВыбрасываетИсключение("Формат '.xml' не поддерживается");

КонецПроцедуры

#КонецОбласти
