// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

Перем _Поделка; // Поделка
Перем _ТекущийКаталог; // Строка

&Инициализация
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();
	
	_ТекущийКаталог = ТекущийКаталог();

КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт
	УстановитьТекущийКаталог(_ТекущийКаталог);
КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределитьМанифестВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	УстановитьТекущийКаталог("./tests/fixtures");

	// Действие
	ПутьКФайлу = ЛокаторМанифеста.НайтиВКаталоге();

	// Утверждение
	Файл = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(Файл.Существует()).ЭтоИстина();
	Ожидаем.Что(Файл.Имя).Равно("packagedef");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределитьМанифестВУказанномКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	// Действие
	ПутьКФайлу = ЛокаторМанифеста.НайтиВКаталоге("./tests/fixtures");

	// Утверждение
	Файл = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(Файл.Существует()).ЭтоИстина();
	Ожидаем.Что(Файл.Имя).Равно("packagedef");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределитьМанифестПоИмениПакетаВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");
	
	Каталоги = Новый Массив();
	Каталоги.Добавить("./tests/fixtures"); // сразу в oscript_modules
	Каталоги.Добавить("./tests/fixtures/oscriptcfg"); // в oscript_modules через oscript.cfg

	Для Каждого Каталог Из Каталоги Цикл

		УстановитьТекущийКаталог(Каталог);

		// Действие
		ПутьКФайлу = ЛокаторМанифеста.НайтиПоИмениПакета("autumn");

		// Утверждение
		Файл = Новый Файл(ПутьКФайлу);

		Ожидаем.Что(Файл.Существует()).ЭтоИстина();
		Ожидаем.Что(Файл.Имя).Равно("opm-metadata.xml");
	
		УстановитьТекущийКаталог(_ТекущийКаталог);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_СообщитьОНеустановленномПакете() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");
	
	УстановитьТекущийКаталог("./tests/fixtures");

	Параметры = Новый Массив();
	Параметры.Добавить("package");

	// Действие и Проверка
	Ожидаем.Что(ЛокаторМанифеста)
		.Метод("НайтиПоИмениПакета", Параметры)
		.ВыбрасываетИсключение("Пакет 'package' не установлен");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СообщитьОбОтсутствииМанифестаВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	УстановитьТекущийКаталог("./tests");
	Каталог = ТекущийКаталог();

	// Действие и Проверка
	Ожидаем.Что(ЛокаторМанифеста)
		.Метод("НайтиВКаталоге")
		.ВыбрасываетИсключение(СтрШаблон("В каталоге '%1' не найден файл манифеста", Каталог));

КонецПроцедуры

&Тест
&Параметры("./tests", "В каталоге '%1' не найден файл манифеста")
&Параметры("./testsss", "Каталог '%1' не найден")
&Параметры("packagedef", "Вместо каталога указан файл '%1'")
Процедура ТестДолжен_СообщитьОбОшибкеДляПереданногоКаталога(
	Каталог,
	ШаблонСообщения
) Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	Параметры = Новый Массив();
	Параметры.Добавить(Каталог);

	// Действие и Проверка
	Ожидаем.Что(ЛокаторМанифеста)
		.Метод("НайтиВКаталоге", Параметры)
		.ВыбрасываетИсключение(СтрШаблон(ШаблонСообщения, Каталог));

КонецПроцедуры
