// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

Перем Поделка; // Поделка

&Инициализация
Процедура Инициализация() Экспорт

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьВерсии() Экспорт

	// Подготовка
	Клиент = ПомощникТестирования.ПолучитьОригинальныйЖелудь(Поделка, "КлиентРеестраПакетов");

	// Действие
	ВерсииПакета = Клиент.ПолучитьВерсии("autumn");

	// Проверка
	Ожидаем.Что(ВерсииПакета).Содержит("4.3.11");
	Ожидаем.Что(ВерсииПакета).Содержит("4.0.0");

КонецПроцедуры