// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

Перем Поделка; // Поделка

&Инициализация
Процедура Инициализация() Экспорт

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиМанифестВКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = Поделка.НайтиЖелудь("ЛокаторМанифеста");

	// Действие
	ПутьКФайлу = ЛокаторМанифеста.НайтиВКаталоге("./tests/fixtures");

	// Проверка
	Файл = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(Файл.Существует()).ЭтоИстина();
	Ожидаем.Что(Файл.Имя).Равно("packagedef");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиМанифестВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = Поделка.НайтиЖелудь("ЛокаторМанифеста");

	// Действие
	ПутьКФайлу = ЛокаторМанифеста.НайтиТекущемКаталоге();

	// Проверка
	Файл = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(Файл.Существует()).ЭтоИстина();
	Ожидаем.Что(Файл.Имя).Равно("packagedef");

КонецПроцедуры