// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off
#Использовать "helpers"

Перем _Поделка; // Поделка

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПередВсеми
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого() Экспорт
	ПомощникТестирования.УдалитьВременныеФайлы();
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьБазовыйСлучайИзФайла() Экспорт

	// Подготовка
	Определитель = _Поделка.НайтиЖелудь("ОпределительВерсийЗависимостей");
	Зависимости = Новый ЗависимостиПакета().ЗаполнитьИзМанифеста(ПомощникТестирования.ФайлМанифеста);

	// Действие
	Результат = Определитель.НайтиВерсии(Зависимости).СкопироватьВТаблицу();

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(7);
	Ожидаем.Что(Результат[0].ИмяПакета).Равно("delegate");
	Ожидаем.Что(Результат[0].МинимальнаяВерсия).Равно("1.0.0");
	Ожидаем.Что(Результат[1].ИмяПакета).Равно("annotations");
	Ожидаем.Что(Результат[1].МинимальнаяВерсия).Равно("1.3.1");
	Ожидаем.Что(Результат[2].ИмяПакета).Равно("asserts");
	Ожидаем.Что(Результат[2].МинимальнаяВерсия).Равно("1.5.0");
	Ожидаем.Что(Результат[3].ИмяПакета).Равно("packageinfo");
	Ожидаем.Что(Результат[3].МинимальнаяВерсия).Равно("1.0.0");
	Ожидаем.Что(Результат[4].ИмяПакета).Равно("autumn");
	Ожидаем.Что(Результат[4].МинимальнаяВерсия).Равно("3.2.0");
	Ожидаем.Что(Результат[5].ИмяПакета).Равно("1testrunner");
	Ожидаем.Что(Результат[5].МинимальнаяВерсия).Равно("1.9.2");
	Ожидаем.Что(Результат[6].ИмяПакета).Равно("semver");
	Ожидаем.Что(Результат[6].МинимальнаяВерсия).Равно("1.0.0");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьНаличиеТолькоУстаревшихПакетов() Экспорт

	// Подготовка
	Определитель = _Поделка.НайтиЖелудь("ОпределительВерсийЗависимостей");
	Зависимости = Новый ЗависимостиПакета().ЗаполнитьИзМанифеста(ПомощникТестирования.ФайлМанифеста);

	// Действие
	Результат = Определитель
		.ТолькоУстаревшие()
		.НайтиВерсии(Зависимости)
		.СкопироватьВТаблицу();

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(3);
	Ожидаем.Что(Результат[0].ИмяПакета).Равно("annotations");
	Ожидаем.Что(Результат[0].МинимальнаяВерсия).Равно("1.3.1");
	Ожидаем.Что(Результат[1].ИмяПакета).Равно("packageinfo");
	Ожидаем.Что(Результат[1].МинимальнаяВерсия).Равно("1.0.0");
	Ожидаем.Что(Результат[2].ИмяПакета).Равно("1testrunner");
	Ожидаем.Что(Результат[2].МинимальнаяВерсия).Равно("1.9.2");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьТипВерсии() Экспорт

	// Подготовка
	ТестовыеСлучаи = Новый Соответствие();
	ТестовыеСлучаи.Вставить(
		ТипыВерсий.Последняя, 
		"annotations@1.3.1,asserts@1.5.0,autumn@3.2.0,delegate@1.0.0,packageinfo@1.0.0,1testrunner@1.9.2,semver@1.0.0"
	);
	ТестовыеСлучаи.Вставить(
		ТипыВерсий.Минорная,
		"annotations@1.3.1,asserts@1.5.0,autumn@3.2.0,delegate@1.0.0,packageinfo@0.8,1testrunner@1.9.2,semver@1.0.0"
	);
	ТестовыеСлучаи.Вставить(
		ТипыВерсий.Патч,
		"annotations@1.3.1,asserts@1.5.0,autumn@3.2.0,delegate@1.0.0,packageinfo@0.7,1testrunner@1.8.0,semver@1.0.0"
	);

	Определитель = _Поделка.НайтиЖелудь("ОпределительВерсийЗависимостей");
	Зависимости = Новый ЗависимостиПакета().ЗаполнитьИзМанифеста(ПомощникТестирования.ФайлМанифеста);

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		ТипВерсии = ТестовыйСлучай.Ключ;
		ИменаПакетов = СтрРазделить(ТестовыйСлучай.Значение, ",", Ложь);

		// Действие
		Результат = Определитель.НайтиВерсии(Зависимости, ТипВерсии).СкопироватьВТаблицу();

		// Проверка
		Ожидаем.Что(Результат, ТипВерсии).ИмеетДлину(ИменаПакетов.Количество());

		Для Каждого СтрокаРезультата Из Результат Цикл		
			ИмяИВерсия = СтрШаблон("%1@%2", СтрокаРезультата.ИмяПакета, СтрокаРезультата.МинимальнаяВерсия);
			Ожидаем.Что(ИменаПакетов, ТипВерсии).Содержит(ИмяИВерсия);
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры
