#Использовать "helpers"

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ИспользоватьОдноРегулярноеВыражениеСтрогойВерсии() Экспорт

	// Подготовка
	ПервоеВыражение = ПроверкаВерсийПакетов.РегулярноеВыражениеСтрогойВерсии();

	// Действие
	ВтороеВыражение = ПроверкаВерсийПакетов.РегулярноеВыражениеСтрогойВерсии();

	// Проверка
	Ожидаем.Что(ВтороеВыражение).Равно(ПервоеВыражение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СтрогоПроверитьВерсиюПакета() Экспорт

	// Подготовка
	НекорректныеВерсии = СтрРазделить("1,1.0,01.0.0,v1.0.0", ",");

	// Действие и Проверка
	Ожидаем.Что(ПроверкаВерсийПакетов.ЭтоКорректная("1.0.0-beta.1+build.5")).ЭтоИстина();
	Для Каждого Версия Из НекорректныеВерсии Цикл
		Ожидаем.Что(ПроверкаВерсийПакетов.ЭтоКорректная(Версия)).ЭтоЛожь();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
