// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

Перем _Поделка; // Поделка
Перем _ИсходныйХост; // Строка
Перем _ИсходныйРезервныйХост; // Строка

&Инициализация
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();
	Настройки = _Поделка.НайтиЖелудь("НастройкиПриложения");
	_ИсходныйХост = Настройки.ХостРепозитория;
	_ИсходныйРезервныйХост = Настройки.ХостРепозиторияРезервный;

КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт

	Настройки = _Поделка.НайтиЖелудь("НастройкиПриложения");
	Настройки.ХостРепозитория = _ИсходныйХост;
	Настройки.ХостРепозиторияРезервный = _ИсходныйРезервныйХост;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьВерсии() Экспорт

	// Подготовка
	Клиент = ПомощникТестирования.ПолучитьОригинальныйЖелудь(_Поделка, "КлиентРеестраПакетов");

	// Действие
	ВерсииПакета = Клиент.ПолучитьВерсии("autumn");

	// Проверка
	Ожидаем.Что(ВерсииПакета).Содержит("4.3.11");
	Ожидаем.Что(ВерсииПакета).Содержит("4.0.0");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СообщитьОНезаданныхХостахРеестра() Экспорт

	// Подготовка
	Клиент = ПомощникТестирования.ПолучитьОригинальныйЖелудь(_Поделка, "КлиентРеестраПакетов");
	УстановитьХосты("", "");
	Параметры = Новый Массив();
	Параметры.Добавить("autumn");

	// Действие и Проверка
	Ожидаем.Что(Клиент)
		.Метод("ПолучитьВерсии", Параметры)
		.ВыбрасываетИсключение("Не настроены хосты реестра пакетов");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СообщитьОНедоступностиОбоихХостов() Экспорт

	// Подготовка
	Клиент = ПомощникТестирования.ПолучитьОригинальныйЖелудь(_Поделка, "КлиентРеестраПакетов");
	УстановитьХосты("127.0.0.1:1", "127.0.0.1:1");
	Параметры = Новый Массив();
	Параметры.Добавить("autumn");

	// Действие и Проверка
	Ожидаем.Что(Клиент)
		.Метод("ПолучитьВерсии", Параметры)
		.ВыбрасываетИсключение(
			"Не удалось получить версии пакета 'autumn' с хостов: 127.0.0.1:1, 127.0.0.1:1"
		);

КонецПроцедуры

Процедура УстановитьХосты(ОсновнойХост, РезервныйХост)

	Настройки = _Поделка.НайтиЖелудь("НастройкиПриложения");
	Настройки.ХостРепозитория = ОсновнойХост;
	Настройки.ХостРепозиторияРезервный = РезервныйХост;

КонецПроцедуры
