// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

Перем _Поделка; // Поделка
Перем _ТекущийКаталог; // Строка

&Инициализация
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();
	
	_ТекущийКаталог = ТекущийКаталог();

КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт
	УстановитьТекущийКаталог(_ТекущийКаталог);
КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределитьМанифестВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	УстановитьТекущийКаталог("./tests/fixtures");

	// Действие
	ПутьКФайлу = ЛокаторМанифеста.НайтиВКаталоге();

	// Утверждение
	Файл = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(Файл.Существует()).ЭтоИстина();
	Ожидаем.Что(Файл.Имя).Равно("packagedef");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределитьМанифестВУказанномКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	// Действие
	ПутьКФайлу = ЛокаторМанифеста.НайтиВКаталоге("./tests/fixtures");

	// Утверждение
	Файл = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(Файл.Существует()).ЭтоИстина();
	Ожидаем.Что(Файл.Имя).Равно("packagedef");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределитьМанифестПоИмениПакетаВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");
	
	Каталоги = Новый Массив();
	Каталоги.Добавить("./tests/fixtures"); // сразу в oscript_modules
	Каталоги.Добавить("./tests/fixtures/oscriptcfg"); // в oscript_modules через oscript.cfg

	Для Каждого Каталог Из Каталоги Цикл

		УстановитьТекущийКаталог(Каталог);

		// Действие
		ПутьКФайлу = ЛокаторМанифеста.НайтиПоИмениПакета("autumn");

		// Утверждение
		Файл = Новый Файл(ПутьКФайлу);

		Ожидаем.Что(Файл.Существует()).ЭтоИстина();
		Ожидаем.Что(Файл.Имя).Равно("opm-metadata.xml");
	
		УстановитьТекущийКаталог(_ТекущийКаталог);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуДляНеустановленногоПакета() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");
	
	УстановитьТекущийКаталог("./tests/fixtures");

	// Действие и Утверждение
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить("package");

	Ожидаем
		.Что(ЛокаторМанифеста)
		.Метод("НайтиПоИмениПакета", ПараметрыМетода)
		.ВыбрасываетИсключение("Не найден установленный пакет 'package'");

КонецПроцедуры

&Тест
Процедура ТестДолжее_ПолучитьОшибкуПриОтсутствииМанифестаВТекущемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	УстановитьТекущийКаталог("./tests");

	// Действие и Утверждение
	Ожидаем
		.Что(ЛокаторМанифеста)
		.Метод("НайтиВКаталоге")
		.ВыбрасываетИсключение("Не найден файл манифеста в текущем каталоге");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуПриОтсутствииМанифестаВУказанномКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить("./tests");

	// Действие и Утверждение
	Ожидаем
		.Что(ЛокаторМанифеста)
		.Метод("НайтиВКаталоге", ПараметрыМетода)
		.ВыбрасываетИсключение("Не найден файл манифеста в каталоге: ./tests");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуДляНесуществующемКаталоге() Экспорт

	// Подготовка
	ЛокаторМанифеста = _Поделка.НайтиЖелудь("ЛокаторМанифеста");

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить("./testsss");

	// Действие и Утверждение
	Ожидаем
		.Что(ЛокаторМанифеста)
		.Метод("НайтиВКаталоге", ПараметрыМетода)
		.ВыбрасываетИсключение("Каталог не существует: ./testsss");

КонецПроцедуры