// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать autumn
#Использовать asserts
#Использовать fs
#Использовать "../src/core"

Перем Поделка; // Поделка

&Инициализация
Процедура Инициализация() Экспорт

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

КонецПроцедуры

&Тест
Процедура ТестДолжен_НайтиИспользованиеПакетовВИсходниках() Экспорт
	
	// Подготовка
	Сканер = Поделка.НайтиЖелудь("СканерИсходников");
	
	// Действие
	Результат = Сканер.НайтиПакеты("./tests/fixtures/ПроектДляСканера");

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(3);
	Ожидаем.Что(Результат[0].ИмяПакета).Равно("test1");
	Ожидаем.Что(ФС.ФайлСуществует(Результат[0].Файл)).ЭтоИстина();
	Ожидаем.Что(Результат[1].ИмяПакета).Равно("test2");
	Ожидаем.Что(ФС.ФайлСуществует(Результат[1].Файл)).ЭтоИстина();
	Ожидаем.Что(Результат[2].ИмяПакета).Равно("test3");
	Ожидаем.Что(ФС.ФайлСуществует(Результат[2].Файл)).ЭтоИстина();

КонецПроцедуры