// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"

&Тест
Процедура ТестДолжен_ПропускатьЛюбоеИмяЕслиФильтрПустой() Экспорт

	Фильтр = Новый ФильтрИменПакетов();

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("delegate")).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СовпадатьСТочнымИменемПакета() Экспорт

	Фильтр = Новый ФильтрИменПакетов("asserts");

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("my-asserts")).ЭтоЛожь();
	Ожидаем.Что(Фильтр.Совпадает("asserts-core")).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СовпадатьСМаскойИмениПакета() Экспорт

	Фильтр = Новый ФильтрИменПакетов("a*s, delegate");

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("delegate")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("autumn")).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СчитатьВопросительныйЗнакОднимЛюбымСимволом() Экспорт

	Фильтр = Новый ФильтрИменПакетов("a?b");

	Ожидаем.Что(Фильтр.Совпадает("acb")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("ab")).ЭтоЛожь();
	Ожидаем.Что(Фильтр.Совпадает("accb")).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазделятьИменаПакетовПробелами() Экспорт

	Фильтр = Новый ФильтрИменПакетов("asserts delegate");

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("delegate")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("autumn")).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СовпадатьСРегулярнымВыражениемИмениПакета() Экспорт

	Фильтр = Новый ФильтрИменПакетов("/(ass.*|d)/");

	Ожидаем.Что(Фильтр.Совпадает("asserts")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("delegate")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("autumn")).ЭтоЛожь();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЭкранироватьСлужебныеСимволыРегулярныхВыраженийВОбычномИмени() Экспорт

	Фильтр = Новый ФильтрИменПакетов("1connector.core");

	Ожидаем.Что(Фильтр.Совпадает("1connector.core")).ЭтоИстина();
	Ожидаем.Что(Фильтр.Совпадает("1connector-core")).ЭтоЛожь();

КонецПроцедуры
