#Использовать "helpers"

#Область ОписаниеПеременных

Перем _ПотокВывода; // ПотокВПамяти

#КонецОбласти

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого() Экспорт
	Если _ПотокВывода <> Неопределено Тогда
		ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);
		_ПотокВывода = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("1.2.3.4", "1.3.0.1", "(1.3.0.1|#color=")
&ИсточникЗначение("1.2.3.4", "1.2.4.1", "1.2.(4.1|#color=")
&ИсточникЗначение("1.2.3.4", "1.2.3.5", "1.2.3.(5|#color=")
Процедура ТестДолжен_РаскраситьЧетырехкомпонентнуюВерсиюПоУровнюОбновления(
	ВерсияДо,
	ВерсияПосле,
	ОжидаемыйТекст
) Экспорт

	// Подготовка
	Изменения = ИзмененияВерсии(ВерсияДо, ВерсияПосле);
	Репортер = СоздатьРепортер();
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();

	// Действие
	Репортер.ВывестиКакПроверенные(Изменения);
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);
	_ПотокВывода = Неопределено;

	// Проверка
	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйТекст);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьПререлизПриПатчОбновлении() Экспорт

	// Подготовка
	Изменения = ИзмененияВерсии("1.2.3", "1.2.4-alpha.1");
	Репортер = Новый КонсольныйРепортерИзмененийЗависимостей(Новый НастройкиФорматирования());
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();

	// Действие
	Репортер.ВывестиКакПроверенные(Изменения);
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);
	_ПотокВывода = Неопределено;

	// Проверка
	Ожидаем.Что(ТекстВывода).Содержит("1.2.(4-alpha.1|#color=");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзмененияВерсии(ВерсияДо, ВерсияПосле)

	Изменения = Новый ТаблицаЗначений();
	Изменения.Колонки.Добавить("ИмяПакета");
	Изменения.Колонки.Добавить("ДляРазработки");
	Изменения.Колонки.Добавить("МинимальнаяВерсияДо");
	Изменения.Колонки.Добавить("МинимальнаяВерсияПосле");

	Изменение = Изменения.Добавить();
	Изменение.ИмяПакета = "package";
	Изменение.ДляРазработки = Ложь;
	Изменение.МинимальнаяВерсияДо = ВерсияДо;
	Изменение.МинимальнаяВерсияПосле = ВерсияПосле;

	Возврат Изменения;

КонецФункции

Функция СоздатьРепортер()

	Возврат Новый КонсольныйРепортерИзмененийЗависимостей(Новый НастройкиФорматирования());

КонецФункции

#КонецОбласти
