// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:LineLength-off

#Использовать "helpers"

Перем _Поделка; // Поделка
Перем _ТекущийКаталог; // Строка
Перем _ПеременныеСредыКонфигурация; // Строка

&Инициализация
Процедура Инициализация() Экспорт

	_ТекущийКаталог = ТекущийКаталог();
	_ПеременныеСредыКонфигурация = ПолучитьПеременнуюСреды("OSCRIPT_CONFIG");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт

	УстановитьТекущийКаталог(_ТекущийКаталог);
	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", _ПеременныеСредыКонфигурация);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьКаталогиИзПеременнойСредыВПорядкеПриоритета() Экспорт

	// Подготовка
	УстановитьТекущийКаталог("./tests");
	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", "lib.system=../tests/fixtures/lib_sets/lib1;lib.additional=../tests/fixtures/lib_sets/lib2");

	// Действие
	Результат = _Поделка.НайтиЖелудь("ОпределительКаталоговБиблиотек").ПолучитьКаталогиБиблиотек();

	// Утверждение
	Ожидаем.Что(Результат).ИмеетДлину(2);
	Ожидаем.Что(ФС.ПутиРавны(Результат[0], ПолучитьПутьКФикстуре("lib_sets/lib2"))).ЭтоИстина();
	Ожидаем.Что(ФС.ПутиРавны(Результат[1], ПолучитьПутьКФикстуре("lib_sets/lib1"))).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазрешитьКаждыйКаталогИзLibAdditionalВЯвномКонфигурационномФайле() Экспорт

	// Подготовка
	УстановитьТекущийКаталог("./tests");
	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", "");

	// Действие
	Результат = _Поделка.НайтиЖелудь("ОпределительКаталоговБиблиотек")
		.УстановитьКонфигурационныйФайл("./fixtures/oscriptcfg-multiple-libs/oscript.cfg")
		.ПолучитьКаталогиБиблиотек();

	// Утверждение
	Ожидаем.Что(Результат).ИмеетДлину(3);
	Ожидаем.Что(ФС.ПутиРавны(Результат[0], ПолучитьПутьКФикстуре("lib_sets/lib2"))).ЭтоИстина();
	Ожидаем.Что(ФС.ПутиРавны(Результат[1], ПолучитьПутьКФикстуре("lib_sets/lib3"))).ЭтоИстина();
	Ожидаем.Что(ФС.ПутиРавны(Результат[2], ПолучитьПутьКФикстуре("oscript_modules"))).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИспользоватьЯвныйКонфигурационныйФайлСПовышеннымПриоритетом() Экспорт

	// Подготовка
	УстановитьТекущийКаталог("./tests");
	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", "lib.system=../tests/fixtures/lib_sets/lib1;lib.additional=../tests/fixtures/lib_sets/lib2");

	// Действие
	Результат = _Поделка.НайтиЖелудь("ОпределительКаталоговБиблиотек")
		.УстановитьКонфигурационныйФайл("./fixtures/oscriptcfg/oscript.cfg")
		.ПолучитьКаталогиБиблиотек();

	// Утверждение
	Ожидаем.Что(Результат).ИмеетДлину(2);
	Ожидаем.Что(ФС.ПутиРавны(Результат[0], ПолучитьПутьКФикстуре("lib_sets/lib2"))).ЭтоИстина();
	Ожидаем.Что(ФС.ПутиРавны(Результат[1], ПолучитьПутьКФикстуре("oscript_modules"))).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьДублиКаталоговСПомощьюСравненияПутей() Экспорт

	// Подготовка
	УстановитьТекущийКаталог("./tests");
	УстановитьПеременнуюСреды("OSCRIPT_CONFIG", "lib.system=../tests/fixtures/lib_sets/lib1;lib.additional=../tests/fixtures/lib_sets/./lib1");

	// Действие
	Результат = _Поделка.НайтиЖелудь("ОпределительКаталоговБиблиотек").ПолучитьКаталогиБиблиотек();

	// Утверждение
	Ожидаем.Что(Результат).ИмеетДлину(1);
	Ожидаем.Что(ФС.ПутиРавны(Результат[0], ПолучитьПутьКФикстуре("lib_sets/lib1"))).ЭтоИстина();

КонецПроцедуры

Функция ПолучитьПутьКФикстуре(ОтносительныйПуть)
	Возврат ФС.НормализоватьПуть(ОбъединитьПути(_ТекущийКаталог, "tests/fixtures/" + ОтносительныйПуть));
КонецФункции