#Использовать "helpers"

Перем _Поделка; // Поделка

#Область ОбработчикиСобытий

&Инициализация
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт

	ПомощникТестирования.УдалитьВременныеФайлы();

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_СообщитьОбОшибкеЧтенияМанифеста() Экспорт

	// Подготовка
	Хранилище = _Поделка.НайтиЖелудь("ФайловоеХранилищеМанифеста");
	ПутьКФайлу = ПомощникТестирования.СоздатьВременныйФайл();
	УдалитьФайлы(ПутьКФайлу);

	Параметры = Новый Массив();
	Параметры.Добавить(ПутьКФайлу);

	// Действие и Проверка
	Ожидаем.Что(Хранилище)
		.Метод("Прочитать", Параметры)
		.ВыбрасываетИсключение(СтрШаблон("Возникла ошибка при чтении файла манифеста '%1'", ПутьКФайлу));

КонецПроцедуры

&Тест
Процедура ТестДолжен_СообщитьОбОшибкеЗаписиМанифеста() Экспорт

	// Подготовка
	Хранилище = _Поделка.НайтиЖелудь("ФайловоеХранилищеМанифеста");
	ПутьККаталогу = ПомощникТестирования.СоздатьВременныйФайл();
	УдалитьФайлы(ПутьККаталогу);
	ПутьКФайлу = ОбъединитьПути(ПутьККаталогу, "packagedef");

	Параметры = Новый Массив();
	Параметры.Добавить(ПутьКФайлу);
	Параметры.Добавить("");

	// Действие и Проверка
	Ожидаем.Что(Хранилище)
		.Метод("Записать", Параметры)
		.ВыбрасываетИсключение(СтрШаблон("Возникла ошибка при записи файла манифеста '%1'", ПутьКФайлу));

КонецПроцедуры

#КонецОбласти
