#Использовать "helpers"

Перем _Поделка; // Поделка

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПередВсеми
Процедура Инициализация() Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ОтклонитьОдновременноеИспользованиеКлючейМанифестаИПакета() Экспорт

	// Подготовка
	Помощник = _Поделка.НайтиЖелудь("ПомощникЗапускаКоманд");
	Помощник
		.УстановитьФайлМанифеста("packagedef")
		.УстановитьИмяУстановленногоПакета("autumn");

	// Действие и Проверка
	Ожидаем.Что(Помощник)
		.Метод("ОпределитьФайлМанифеста")
		.ВыбрасываетИсключение("Ключи -m (--manifest) и -p (--package) нельзя использовать одновременно");

КонецПроцедуры

#КонецОбласти
