#Использовать autumn
#Использовать asserts
#Использовать "../src/core"

Перем Поделка;

&Инициализация
Процедура Инициализация() Экспорт

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьВерсии() Экспорт

	// Подготовка
	Клиент = Новый КлиентРеестраПакетов(
		Поделка.НайтиЖелудь("ПарсерСтраницыПакета"),
		Поделка.НайтиЖелудь("НастройкиПриложения")
	);

	// Действие
	ВерсииПакета = Клиент.ПолучитьВерсии("autumn");

	// Проверка
	Ожидаем.Что(ВерсииПакета).Содержит("4.3.11");
	Ожидаем.Что(ВерсииПакета).Содержит("4.0.0");

КонецПроцедуры

Инициализация();
ТестДолжен_ПолучитьВерсии();