// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

#Использовать "helpers"
#Использовать logos

Перем _Поделка; // Поделка
Перем _ПотокВывода; // ПотокВПамяти
Перем _ТекущийКаталог; // Строка
Перем _Лог; // Лог
Перем _СообщенияОтладочногоЛога; // Массив

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПередВсеми
Процедура Инициализация() Экспорт
	_ТекущийКаталог = ТекущийКаталог();
КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым() Экспорт
	_Лог = Неопределено;
	_СообщенияОтладочногоЛога = Новый Массив();
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого() Экспорт

	Если _Лог <> Неопределено Тогда
		_Лог.УдалитьСпособВывода(ЭтотОбъект);
		Логирование.ЗакрытьЛог(_Лог);
		_Лог = Неопределено;
	КонецЕсли;

	ПомощникТестирования.УдалитьВременныеФайлы();
	УстановитьТекущийКаталог(_ТекущийКаталог);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиПоПереданномуМанифесту() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|↑ packageinfo       0.7   → 1.0.0
	|↑ 1testrunner  dev  1.9.0 → 1.9.2";

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--manifest");
	ПараметрыКоманды.Добавить("./tests/fixtures/packagedef-another");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиМанифестаВТекущемКаталоге() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|↑ packageinfo       0.7   → 1.0.0
	|  semver            1.0.0 → 1.0.0
	|↑ 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиМанифестаВУказанномКаталоге() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|↑ packageinfo       0.7   → 1.0.0
 	|  semver            1.0.0 → 1.0.0
	|↑ 1testrunner  dev  1.8.0 → 1.9.2";

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--manifest");
	ПараметрыКоманды.Добавить("./tests/fixtures");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьТолькоУстаревшиеЗависимости() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations       1.3.0 → 1.3.1
	|↑ packageinfo       0.7   → 1.0.0
	|↑ 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-d");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиСПоследнимиВерсиями() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|↑ packageinfo       0.7   → 1.0.0
 	|  semver            1.0.0 → 1.0.0
	|↑ 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-t");
	ПараметрыКоманды.Добавить("latest");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиСМинорнымиВерсиями() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод = 
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|↑ packageinfo       0.7   → 0.8
 	|  semver            1.0.0 → 1.0.0
	|↑ 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-t");
	ПараметрыКоманды.Добавить("minor");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиСПатчВерсиями() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод = 
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|  packageinfo       0.7   → 0.7
	|  semver            1.0.0 → 1.0.0
	|  1testrunner  dev  1.8.0 → 1.8.0";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-t");
	ПараметрыКоманды.Добавить("patch");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиПоФильтру() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод = 
	"↑ annotations    1.3.0 → 1.3.1
	|  asserts        *     → 1.5.0
	|  autumn         3.2.0 → 3.2.0";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-f");
	ПараметрыКоманды.Добавить("a*");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуНеНайденыЗависимости() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод = "Не найдены зависимости по заданным условиям";

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--manifest");
	ПараметрыКоманды.Добавить("./tests/fixtures/packagedef-no-deps");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуНеНайденФайлМанифестаВТекущемКаталоге() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйПользовательскийВывод = "manifest.not_found: В каталоге";

	УстановитьТекущийКаталог("./tests");

	_Поделка = ПомощникТестирования.ОтладочнаяПоделка();
	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");
	ПодключитьСборОтладочногоЛога();

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);
	ТекстДиагностики = СтрСоединить(_СообщенияОтладочногоЛога, Символы.ПС);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйПользовательскийВывод);
	Ожидаем.Что(ТекстВывода)
		.Содержит("Убедитесь, что указан каталог, содержащий packagedef или opm-metadata.xml.");
	Ожидаем.Что(ТекстДиагностики).Содержит("Место:");

КонецПроцедуры

Процедура ПодключитьСборОтладочногоЛога()
	_Лог = Логирование.ПолучитьЛог("oscript.lib.depos.КомандаCheck");
	_Лог.ДобавитьСпособВывода(ЭтотОбъект, УровниЛога.Отладка);
КонецПроцедуры

// Сохраняет отладочное сообщение временного appender'а.
//
// Параметры:
//   Сообщение - Строка - Форматированное сообщение.
//   УровеньСообщения - Число - Уровень сообщения logos.
Процедура Вывести(Сообщение, УровеньСообщения) Экспорт
	Если УровеньСообщения = УровниЛога.Отладка Тогда
		_СообщенияОтладочногоЛога.Добавить(Сообщение);
	КонецЕсли;
КонецПроцедуры

// Завершает работу временного appender'а.
Процедура Закрыть() Экспорт
КонецПроцедуры

&Тест
Процедура ТестДолжен_ВывестиИзмененияЗависимостейВJson() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	УстановитьТекущийКаталог("./tests/fixtures");

	ФайлВывода = ПомощникТестирования.СоздатьВременныйФайл("json");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--output");
	ПараметрыКоманды.Добавить(ФайлВывода);

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	Ожидаем.Что(ФС.ФайлСуществует(ФайлВывода)).ЭтоИстина();

	ЧтениеТекста = Новый ЧтениеТекста(ФайлВывода, "UTF-8");
	СтрокаJson = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Десериализатор = Новый ДесериализаторJson();
	ПроверяемыйОбъект = Десериализатор.Десериализовать(СтрокаJson);

	Ожидаем.Что(ПроверяемыйОбъект).ИмеетТип("Массив");
	Ожидаем.Что(ПроверяемыйОбъект).ИмеетДлину(7);

	Ожидаем.Что(ПроверяемыйОбъект[0].packageName, "[0].packageName").Равно("annotations");
	Ожидаем.Что(ПроверяемыйОбъект[0].isDev, "[0].isDev").Равно(Ложь);
	Ожидаем.Что(ПроверяемыйОбъект[0].minVersionBefore, "[0].minVersionBefore").Равно("1.3.0");
	Ожидаем.Что(ПроверяемыйОбъект[0].minVersionAfter, "[0].minVersionAfter").Равно("1.3.1");
	Ожидаем.Что(ПроверяемыйОбъект[0].maxVersion, "[0].maxVersion").Равно("");

	Ожидаем.Что(ПроверяемыйОбъект[1].packageName, "[1].packageName").Равно("asserts");
	Ожидаем.Что(ПроверяемыйОбъект[1].isDev, "[1].isDev").Равно(Ложь);
	Ожидаем.Что(ПроверяемыйОбъект[1].minVersionBefore, "[1].minVersionBefore").Равно("");
	Ожидаем.Что(ПроверяемыйОбъект[1].minVersionAfter, "[1].minVersionAfter").Равно("1.5.0");
	Ожидаем.Что(ПроверяемыйОбъект[1].maxVersion, "[1].maxVersion").Равно("");

	Ожидаем.Что(ПроверяемыйОбъект[2].packageName, "[2].packageName").Равно("autumn");
	Ожидаем.Что(ПроверяемыйОбъект[2].isDev, "[2].isDev").Равно(Ложь);
	Ожидаем.Что(ПроверяемыйОбъект[2].minVersionBefore, "[2].minVersionBefore").Равно("3.2.0");
	Ожидаем.Что(ПроверяемыйОбъект[2].minVersionAfter, "[2].minVersionAfter").Равно("3.2.0");
	Ожидаем.Что(ПроверяемыйОбъект[2].maxVersion, "[2].maxVersion").Равно("4.4.1");

	Ожидаем.Что(ПроверяемыйОбъект[3].packageName, "[3].packageName").Равно("delegate");
	Ожидаем.Что(ПроверяемыйОбъект[3].isDev, "[3].isDev").Равно(Ложь);
	Ожидаем.Что(ПроверяемыйОбъект[3].minVersionBefore, "[3].minVersionBefore").Равно("1.0.0");
	Ожидаем.Что(ПроверяемыйОбъект[3].minVersionAfter, "[3].minVersionAfter").Равно("1.0.0");
	Ожидаем.Что(ПроверяемыйОбъект[3].maxVersion, "[3].maxVersion").Равно("");

	Ожидаем.Что(ПроверяемыйОбъект[4].packageName, "[4].packageName").Равно("packageinfo");
	Ожидаем.Что(ПроверяемыйОбъект[4].isDev, "[4].isDev").Равно(Ложь);
	Ожидаем.Что(ПроверяемыйОбъект[4].minVersionBefore, "[4].minVersionBefore").Равно("0.7");
	Ожидаем.Что(ПроверяемыйОбъект[4].minVersionAfter, "[4].minVersionAfter").Равно("1.0.0");
	Ожидаем.Что(ПроверяемыйОбъект[4].maxVersion, "[4].maxVersion").Равно("");

	Ожидаем.Что(ПроверяемыйОбъект[5].packageName, "[5].packageName").Равно("semver");
	Ожидаем.Что(ПроверяемыйОбъект[5].isDev, "[5].isDev").Равно(Ложь);
	Ожидаем.Что(ПроверяемыйОбъект[5].minVersionBefore, "[5].minVersionBefore").Равно("1.0.0");
	Ожидаем.Что(ПроверяемыйОбъект[5].minVersionAfter, "[5].minVersionAfter").Равно("1.0.0");
	Ожидаем.Что(ПроверяемыйОбъект[5].maxVersion, "[5].maxVersion").Равно("1.1.0");

	Ожидаем.Что(ПроверяемыйОбъект[6].packageName, "[6].packageName").Равно("1testrunner");
	Ожидаем.Что(ПроверяемыйОбъект[6].isDev, "[6].isDev").Равно(Истина);
	Ожидаем.Что(ПроверяемыйОбъект[6].minVersionBefore, "[6].minVersionBefore").Равно("1.8.0");
	Ожидаем.Что(ПроверяемыйОбъект[6].minVersionAfter, "[6].minVersionAfter").Равно("1.9.2");
	Ожидаем.Что(ПроверяемыйОбъект[6].maxVersion, "[6].maxVersion").Равно("");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуПриПередачеНеподдерживаемогоФорматаФайлаВывода() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод = "Формат '.xml' не поддерживается";

	УстановитьТекущийКаталог("./tests/fixtures");

	ФайлВывода = ПомощникТестирования.СоздатьВременныйФайл("xml");

	_Поделка = ПомощникТестирования.ОтладочнаяПоделка();
	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--output");
	ПараметрыКоманды.Добавить(ФайлВывода);

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);
	Ожидаем.Что(ТекстВывода).Содержит("Укажите файл с расширением '.json'.");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиПоИмениПакета() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations       1.3.0 → 1.3.1
	|  asserts           *     → 1.5.0
	|  autumn            3.2.0 → 3.2.0
	|  delegate          1.0.0 → 1.0.0
	|↑ packageinfo       0.7   → 1.0.0
	|  semver            1.0.0 → 1.0.0
	|↑ 1testrunner  dev  1.8.0 → 1.9.2";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--package");
	ПараметрыКоманды.Добавить("mypackage");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьОшибкуПриПередачеКлючейМанифестаИИмениПакета() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод = "Ключи -m (--manifest) и -p (--package) нельзя использовать одновременно";

	_Поделка = ПомощникТестирования.ОтладочнаяПоделка();
	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--manifest");
	ПараметрыКоманды.Добавить("./tests/fixtures/packagedef");
	ПараметрыКоманды.Добавить("--package");
	ПараметрыКоманды.Добавить("autumn");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьЗависимостиСИсключениемПоФильтру() Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	ОжидаемыйВывод =
	"↑ annotations    1.3.0 → 1.3.1
	|  asserts        *     → 1.5.0
	|  autumn         3.2.0 → 3.2.0";

	УстановитьТекущийКаталог("./tests/fixtures");

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("-x");
	ПараметрыКоманды.Добавить("delegate,packageinfo,1testrunner,semver");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Утверждение
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);

	Ожидаем.Что(ТекстВывода).Содержит(ОжидаемыйВывод);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("bogus")
&ИсточникЗначение("Последняя")
&ИсточникЗначение("LATEST")
&ИсточникЗначение(" latest ")
Процедура ТестДолжен_СообщитьОНекорректномТипеЦелевойВерсии(НекорректныйТипВерсии) Экспорт

	// Подготовка
	_ПотокВывода = ПомощникТестирования.ПерехватитьПотокВывода();
	_Поделка = ПомощникТестирования.ОтладочнаяПоделка();
	КонсольноеПриложение = _Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("check");
	ПараметрыКоманды.Добавить("--target");
	ПараметрыКоманды.Добавить(НекорректныйТипВерсии);
	ПараметрыКоманды.Добавить("--manifest");
	ПараметрыКоманды.Добавить("./tests/nonexistent");

	// Действие
	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Проверка
	ТекстВывода = ПомощникТестирования.ПолучитьТекстИзПотокаВывода(_ПотокВывода);
	Ожидаем.Что(ТекстВывода).Содержит("target.invalid");
	Ожидаем.Что(ТекстВывода).Содержит(НекорректныйТипВерсии);
	Ожидаем.Что(ТекстВывода).Содержит("latest, minor, patch");
	Ожидаем.Что(ТекстВывода).Не_().Содержит("manifest.not_found");

КонецПроцедуры
