#Использовать "helpers"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение(Неопределено, 2, 1, 1)
&ИсточникЗначение("usage", 2, 0, 0)
&ИсточникЗначение("installed", 0, 1, 0)
&ИсточникЗначение("transitive", 0, 1, 1)
&ИсточникЗначение("usage,installed", 2, 1, 0)
&ИсточникЗначение("usage,transitive", 2, 1, 1)
&ИсточникЗначение("installed,transitive", 0, 1, 1)
&ИсточникЗначение("usage,installed,transitive", 2, 1, 1)
Процедура ТестДолжен_ВыполнитьТолькоВыбранныеПроверки(
	ЗначениеОпции,
	ОжидаетсяПоисковВИсходниках,
	ОжидаетсяПоисковУстановленных,
	ОжидаетсяТранзитивныхАнализов
) Экспорт

	// Подготовка
	СканерИсходников = Новый СканерИсходниковСУчетомВызовов();
	СканерУстановленных = Новый СканерУстановленныхПакетовСУчетомВызовов();
	ТранзитивныйАнализатор = Новый АнализаторТранзитивныхЗависимостейСУчетомВызовов();
	Анализатор = Новый АнализаторЗависимостей(
		СканерИсходников,
		СканерУстановленных,
		ТранзитивныйАнализатор
	);
	ВыборПроверок = Новый ВыборПроверокЗависимостей(ЗначениеОпции);

	// Действие
	Результат = Анализатор.ПроверитьЗависимости(Новый ЗависимостиПакета(), ВыборПроверок);

	// Проверка
	Ожидаем.Что(СканерИсходников.КоличествоВызовов()).Равно(ОжидаетсяПоисковВИсходниках);
	Ожидаем.Что(СканерУстановленных.КоличествоВызовов()).Равно(ОжидаетсяПоисковУстановленных);
	Ожидаем.Что(ТранзитивныйАнализатор.КоличествоВызовов()).Равно(ОжидаетсяТранзитивныхАнализов);
	Ожидаем.Что(Результат.КоличествоПроблем()).Равно(0);

КонецПроцедуры

#КонецОбласти
