#Использовать semver
#Использовать "../../internal"

#Область ОписаниеПеременных

Перем _ТолькоУстаревшие; // Булево
Перем _ОпределительВерсийПакетов; // ОпределительВерсийПакетов

#КонецОбласти

#Область ОбработчикиСобытий

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта(&Пластилин("ОпределительВерсийПакетов") ОпределительВерсийПакетов)
	_ОпределительВерсийПакетов = ОпределительВерсийПакетов;
	ТолькоУстаревшие(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Получает зависимости с целевыми версиями.
//
// Параметры:
//   Зависимости - ЗависимостиПакета
//   ТипВерсии - Строка - Тип целевой версии (см. ТипыВерсий).
//                        Если не указан или пустой, используется значение "Последняя".
//
// Возвращаемое значение:
//   ЗависимостиПакета
Функция НайтиВерсии(Зависимости, ТипВерсии = Неопределено) Экспорт

	ТаблицаЗависимостей = Зависимости.СкопироватьВТаблицу();
	ЗависимостиДляПоискаВерсий = ЗависимостиБезМаксимальнойВерсии(ТаблицаЗависимостей);
	ЦелевыеВерсииПакетов = _ОпределительВерсийПакетов.НайтиВерсии(
		ЗависимостиДляПоискаВерсий,
		ТипВерсии
	);

	Результат = Новый ЗависимостиПакета();

	Для Каждого СтрокаЗависимости Из ТаблицаЗависимостей Цикл

		Если Не ЗначениеЗаполнено(СтрокаЗависимости.МаксимальнаяВерсия) Тогда
			Версия = ЦелевыеВерсииПакетов[СтрокаЗависимости.ИмяПакета];
		Иначе
			Версия = СтрокаЗависимости.МинимальнаяВерсия;
		КонецЕсли;

		ВерсияБольшеИсходной = ЗначениеЗаполнено(Версия) 
			И ЗначениеЗаполнено(СтрокаЗависимости.МинимальнаяВерсия)
			И Версии.ВерсияБольше(Версия, Новый Версия(СтрокаЗависимости.МинимальнаяВерсия));
		
		Если Не _ТолькоУстаревшие Или ВерсияБольшеИсходной Тогда
			Результат.Добавить(
				СтрокаЗависимости.ИмяПакета,
				Версия,
				СтрокаЗависимости.МаксимальнаяВерсия,
				СтрокаЗависимости.ДляРазработки
			);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Устанавливает фильтр по устаревшим пакетам.
//
// Параметры:
//   Включить - Булево - Если Истина, возвращаются только пакеты с устаревшими версиями
//
// Возвращаемое значение:
//   ЭтотОбъект - Для поддержки цепочки вызовов
Функция ТолькоУстаревшие(Включить = Истина) Экспорт
	_ТолькоУстаревшие = Включить;
	Возврат ЭтотОбъект;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗависимостиБезМаксимальнойВерсии(Зависимости)

	Результат = Зависимости.Скопировать();
	Количество = Результат.Количество();
	Для Индекс = 1 По Количество Цикл
		СтрокаЗависимости = Результат[Количество - Индекс];
		Если ЗначениеЗаполнено(СтрокаЗависимости.МаксимальнаяВерсия) Тогда
			Результат.Удалить(СтрокаЗависимости);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
