// BSLLS:ExportVariables-off

#Область ОписаниеПеременных

&Сериализуемое("packageName")
&Тип("Строка")
Перем ИмяПакета Экспорт; // Строка

&Сериализуемое("isDev")
&Тип("Булево")
Перем ДляРазработки Экспорт; // Булево

&Сериализуемое("rootDirectDependency")
&Тип("Строка")
Перем КорневаяПрямаяЗависимость Экспорт; // Строка

&Сериализуемое("requirementSource")
&Тип("Строка")
Перем ИсточникТребования Экспорт; // Строка

&Сериализуемое("minVersion")
&Тип("Строка")
Перем МинимальнаяВерсия Экспорт; // Строка

&Сериализуемое("maxVersion")
&Тип("Строка")
Перем МаксимальнаяВерсия Экспорт; // Строка

&Сериализуемое("requiredVersion")
&Тип("Строка")
Перем ТребуемаяВерсия Экспорт; // Строка

&Сериализуемое("dependencyChain")
&Тип("Массив") &ДляКаждого &Тип("Строка")
Перем ЦепочкаЗависимостей Экспорт; // Массив из Строка

#КонецОбласти

#Область ОбработчикиСобытий

// Создает пустое структурированное требование зависимости.
Процедура ПриСозданииОбъекта()

	ИмяПакета = "";
	ДляРазработки = Ложь;
	КорневаяПрямаяЗависимость = "";
	ИсточникТребования = "";
	МинимальнаяВерсия = "";
	МаксимальнаяВерсия = "";
	ТребуемаяВерсия = "";
	ЦепочкаЗависимостей = Новый Массив();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Создает независимую копию требования и его цепочки зависимостей.
//
// Возвращаемое значение:
//   ТребованиеЗависимости
Функция Копия() Экспорт

	Результат = Новый ТребованиеЗависимости();
	Результат.ИмяПакета = ИмяПакета;
	Результат.ДляРазработки = ДляРазработки;
	Результат.КорневаяПрямаяЗависимость = КорневаяПрямаяЗависимость;
	Результат.ИсточникТребования = ИсточникТребования;
	Результат.МинимальнаяВерсия = МинимальнаяВерсия;
	Результат.МаксимальнаяВерсия = МаксимальнаяВерсия;
	Результат.ТребуемаяВерсия = ТребуемаяВерсия;

	Для Каждого ПакетЦепочки Из ЦепочкаЗависимостей Цикл
		Результат.ЦепочкаЗависимостей.Добавить(ПакетЦепочки);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
