// BSLLS:ExportVariables-off

#Область ОписаниеПеременных

Перем ИмяПакета Экспорт; // Строка
Перем ДляРазработки Экспорт; // Булево
Перем КорневаяПрямаяЗависимость Экспорт; // Строка
Перем ИсточникТребования Экспорт; // Строка
Перем МинимальнаяВерсия Экспорт; // Строка
Перем МаксимальнаяВерсия Экспорт; // Строка
Перем ТребуемаяВерсия Экспорт; // Строка
Перем ЦепочкаЗависимостей Экспорт; // Массив

#КонецОбласти

#Область ОбработчикиСобытий

// Создает пустое структурированное требование зависимости.
Процедура ПриСозданииОбъекта()

	ИмяПакета = "";
	ДляРазработки = Ложь;
	КорневаяПрямаяЗависимость = "";
	ИсточникТребования = "";
	МинимальнаяВерсия = "";
	МаксимальнаяВерсия = "";
	ТребуемаяВерсия = "";
	ЦепочкаЗависимостей = Новый Массив();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Создает независимую копию требования и его цепочки зависимостей.
//
// Возвращаемое значение:
//   ТребованиеЗависимости
Функция Копия() Экспорт

	Результат = Новый ТребованиеЗависимости();
	Результат.ИмяПакета = ИмяПакета;
	Результат.ДляРазработки = ДляРазработки;
	Результат.КорневаяПрямаяЗависимость = КорневаяПрямаяЗависимость;
	Результат.ИсточникТребования = ИсточникТребования;
	Результат.МинимальнаяВерсия = МинимальнаяВерсия;
	Результат.МаксимальнаяВерсия = МаксимальнаяВерсия;
	Результат.ТребуемаяВерсия = ТребуемаяВерсия;

	Для Каждого ПакетЦепочки Из ЦепочкаЗависимостей Цикл
		Результат.ЦепочкаЗависимостей.Добавить(ПакетЦепочки);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
