#Использовать semver

#Область ОписаниеПеременных

Перем _РегулярноеВыражениеСтрогойВерсии; // РегулярноеВыражение

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает кэшированное регулярное выражение для строгой проверки SemVer.
//
// Возвращаемое значение:
//   РегулярноеВыражение - Регулярное выражение строгого формата SemVer.
Функция РегулярноеВыражениеСтрогойВерсии() Экспорт

	Если _РегулярноеВыражениеСтрогойВерсии = Неопределено Тогда
		_РегулярноеВыражениеСтрогойВерсии = СоздатьРегулярноеВыражениеСтрогойВерсии();
	КонецЕсли;

	Возврат _РегулярноеВыражениеСтрогойВерсии;

КонецФункции

// Проверяет строку на соответствие строгому формату SemVer.
//
// Параметры:
//   ВерсияСтрокой - Строка - Проверяемая версия.
//
// Возвращаемое значение:
//   Булево - Истина, если строка содержит корректную SemVer-версию.
Функция ЭтоКорректная(ВерсияСтрокой) Экспорт

	Если ТипЗнч(ВерсияСтрокой) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Не РегулярноеВыражениеСтрогойВерсии().Совпадает(ВерсияСтрокой) Тогда
		Возврат Ложь;
	КонецЕсли;

	Версия = Новый Версия(ВерсияСтрокой);
	Возврат Не Версия.Ошибка();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьРегулярноеВыражениеСтрогойВерсии()

	Число = "(0|[1-9][0-9]*)";
	АлфавитноЧисловойИдентификатор = "[0-9]*[A-Za-z-][0-9A-Za-z-]*";
	ИдентификаторПререлиза = "(" + Число + "|" + АлфавитноЧисловойИдентификатор + ")";
	Пререлиз = ИдентификаторПререлиза + "(\." + ИдентификаторПререлиза + ")*";
	Метаданные = "[0-9A-Za-z-]+(\.[0-9A-Za-z-]+)*";

	Возврат Новый РегулярноеВыражение(
		"^" + Число + "\." + Число + "\." + Число + "(-" + Пререлиз + ")?(\+" + Метаданные + ")?$");

КонецФункции

#КонецОбласти
