// BSLLS:ExportVariables-off

#Область ОписаниеПеременных

Перем Использование Экспорт; // Строка
Перем УстановленныеПакеты Экспорт; // Строка
Перем ТранзитивныеЗависимости Экспорт; // Строка

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает все допустимые типы проверок зависимостей.
//
// Возвращаемое значение:
//   Массив из Строка - Имена проверок для параметра --checks.
Функция Все() Экспорт

	Результат = Новый Массив();
	Результат.Добавить(Использование);
	Результат.Добавить(УстановленныеПакеты);
	Результат.Добавить(ТранзитивныеЗависимости);

	Возврат Результат;

КонецФункции

#КонецОбласти

Использование = "usage";
УстановленныеПакеты = "installed";
ТранзитивныеЗависимости = "transitive";
