&Желудь("КлиентРеестраПакетов")
&Верховный
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция ПолучитьВерсии(ИмяПакета) Экспорт
	
	ВерсииПакета = Новый Массив();

	Если ИмяПакета = "autumn" Тогда
		ВерсииПакета.Добавить("4.3.11");
		ВерсииПакета.Добавить("3.3.0");
		ВерсииПакета.Добавить("3.2.0");
	ИначеЕсли ИмяПакета = "delegate" Тогда
		ВерсииПакета.Добавить("1.0.0");
	ИначеЕсли ИмяПакета = "annotations" Тогда
		ВерсииПакета.Добавить("1.3.1");
	ИначеЕсли ИмяПакета = "asserts" Тогда
		ВерсииПакета.Добавить("1.5.0");
		ВерсииПакета.Добавить("1.4.0");
	ИначеЕсли ИмяПакета = "1testrunner" Тогда
		ВерсииПакета.Добавить("1.9.2");
		ВерсииПакета.Добавить("1.9.0");
		ВерсииПакета.Добавить("1.8.0");
	ИначеЕсли ИмяПакета = "packageinfo" Тогда
		ВерсииПакета.Добавить("1.0.0");
		ВерсииПакета.Добавить("0.8");
		ВерсииПакета.Добавить("0.7");
	ИначеЕсли ИмяПакета = "semver" Тогда
		ВерсииПакета.Добавить("1.2.0");
		ВерсииПакета.Добавить("1.1.0");
		ВерсииПакета.Добавить("1.0.0");
	Иначе
		ВызватьИсключение СтрШаблон("Пакет %1 не найден", ИмяПакета);
	КонецЕсли;

	Возврат ВерсииПакета;

КонецФункции