#Использовать coloratos
#Использовать "../../core"
#Использовать "../../internal"

#Область Опции

&Опция(Имя = "m manifest", Описание = "Путь к файлу манифеста или его каталогу (по умолчанию - текущая директория)")
&ТСтрока
Перем _ФайлМанифеста; // Строка, Неопределено

&Опция(
	Имя = "f filter",
	Описание = "Оставляет зависимости по выражению: список имен, маска или регулярное выражение (например, /^autumn-.*$/)"
)
&ТСтрока
Перем _ФильтрПоИмени; // Строка

&Опция(Имя = "t target", Описание = "Тип целевой версии: latest, minor или patch")
&ПоУмолчанию("latest")
&ТСтрока
Перем _ТипВерсии; // Строка, Неопределено

&Опция(Имя = "backup", Описание = "Создать резервную копию файла packagedef перед изменением")
&Флаг
&ПоУмолчанию(Ложь)
Перем _СохранятьКопию; // Булево

&Опция(
	Имя = "x exclude",
	Описание = "Исключает зависимости по выражению: список имен, маска или регулярное выражение (например, /^autumn-.*$/)"
)
&ТСтрока
Перем _ВыражениеИсключенияИменПакетов; // Строка

&Опция(Имя = "o output", Описание = "Экспорт отчета об обновлениях в JSON-файл (.json)")
&ТСтрока
Перем _ИмяФайлаВывода; // Строка

#КонецОбласти

#Область ОписаниеПеременных

&ЛогDepos
Перем _Лог; // Лог

&Пластилин("ПомощникЗапускаКоманд")
Перем _ПомощникЗапускаКоманд; // ПомощникЗапускаКоманд

&Пластилин("КонсольныйРепортерИзмененийЗависимостей")
Перем _КонсольныйРепортерИзмененийЗависимостей; // КонсольныйРепортерИзмененийЗависимостей

&Пластилин("ОпределительВерсийЗависимостей")
Перем _ОпределительВерсийЗависимостей; // ОпределительВерсийЗависимостей

&Пластилин("ОбновляторЗависимостей")
Перем _ОбновляторЗависимостей; // ОбновляторЗависимостей

#КонецОбласти

&КомандаПриложения(Имя = "upgrade", Описание = "Обновление зависимостей")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ЗапуститьБезопасно() Экспорт

	Попытка
		Запустить();
	Исключение
		_ПомощникЗапускаКоманд.ОбработатьОшибку(ИнформацияОбОшибке(), _Лог);
	КонецПопытки;

КонецПроцедуры

Процедура Запустить()

	ТипВерсии = ТипыВерсий.ИзАргументаКоманднойСтроки(_ТипВерсии);
	ФайлМанифеста = ПолучитьФайлМанифеста();
	
	Консоль.ВывестиСтроку(СтрШаблон("Обновление зависимостей: %1" + Символы.ПС, ФайлМанифеста));

	ИсходныеЗависимости = ПолучитьИсходныеЗависимости(ФайлМанифеста);

	ЦелевыеЗависимости = _ОпределительВерсийЗависимостей
		.ТолькоУстаревшие()
		.НайтиВерсии(ИсходныеЗависимости, ТипВерсии);

	Если ЦелевыеЗависимости.ЭтоПустой() Тогда
		ЦветнойВывод.ВывестиСтроку("Не найдены зависимости для обновления", "ТемноЖелтый");
		Возврат;
	КонецЕсли;

	ИзмененияЗависимостей = ЦелевыеЗависимости.ПолучитьИзмененияОтносительно(ИсходныеЗависимости);
		
	_КонсольныйРепортерИзмененийЗависимостей.ВывестиКакОбновленные(ИзмененияЗависимостей);

	_ОбновляторЗависимостей
		.СохранятьКопию(_СохранятьКопию)
		.Обновить(ФайлМанифеста, ЦелевыеЗависимости);

	Консоль.ВывестиСтроку(" ");
	ЦветнойВывод.ВывестиСтроку("Выполните (opm install|#color=Желтый) для установки новых версий пакетов.");

	ЭкспортироватьРезультаты(ИзмененияЗависимостей);

КонецПроцедуры

Функция ПолучитьФайлМанифеста()

	_ПомощникЗапускаКоманд.УстановитьФайлМанифеста(_ФайлМанифеста);
	Возврат _ПомощникЗапускаКоманд.ОпределитьФайлМанифеста();

КонецФункции

Функция ПолучитьИсходныеЗависимости(ФайлМанифеста)

	Возврат Новый ЗависимостиПакета()
		.ЗаполнитьИзМанифеста(ФайлМанифеста)
		.ОставитьПоИмени(_ФильтрПоИмени)
		.УдалитьПоИмени(_ВыражениеИсключенияИменПакетов);

КонецФункции

Процедура ЭкспортироватьРезультаты(ИзмененияЗависимостей)

	Если ЗначениеЗаполнено(_ИмяФайлаВывода) Тогда
		Экспортер = Новый ЭкспортерИзмененийЗависимостей();
		Экспортер.Записать(ИзмененияЗависимостей, _ИмяФайлаВывода);
	КонецЕсли;

КонецПроцедуры
