#Область ОписаниеПеременных

Перем _Серверы; // Массив из Структура
Перем _УчитыватьЗеркало; // Булево
Перем _Прокси; // Структура, Неопределено

#КонецОбласти

#Область ОбработчикиСобытий

// Создает провайдер с заданными настройками.
//
// Параметры:
//   Серверы - Массив из Структура:
//     * Имя          - Строка - Имя сервера пакетов.
//     * Адрес         - URL - Адрес сервера пакетов.
//     * Пул           - Строка - Имя пула пакетов.
//     * Заголовки     - Соответствие - HTTP-заголовки запросов к серверу.
//   Прокси - Структура, Неопределено - Настройки proxy.
Процедура ПриСозданииОбъекта(Серверы, Прокси = Неопределено)

	_Серверы = Серверы;
	_Прокси = Прокси;
	_УчитыватьЗеркало = Истина;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает настройки серверов и proxy.
//
// Параметры:
//   УчитыватьЗеркало - Булево - Учитывать OPM_HUB_MIRROR.
//
// Возвращаемое значение:
//   Структура:
//     * Серверы - Массив из Структура:
//       ** Имя          - Строка - Имя сервера пакетов.
//       ** Адрес         - URL - Адрес сервера пакетов.
//       ** Пул           - Строка - Имя пула пакетов.
//       ** Заголовки     - Соответствие - HTTP-заголовки запросов к серверу.
//     * Прокси - Структура, Неопределено - Настройки proxy.
Функция ПолучитьНастройки(УчитыватьЗеркало = Истина) Экспорт

	_УчитыватьЗеркало = УчитыватьЗеркало;
	ИмяЗеркала = ?(УчитыватьЗеркало, ПолучитьПеременнуюСреды("OPM_HUB_MIRROR"), "");
	Серверы = Новый Массив;
	Для Каждого Сервер Из _Серверы Цикл
		Если ПустаяСтрока(ИмяЗеркала) Или Сервер.Имя = ИмяЗеркала Тогда
			Серверы.Добавить(Сервер);
		КонецЕсли;
	КонецЦикла;

	Возврат Новый Структура("Серверы,Прокси", Серверы, _Прокси);

КонецФункции

// Возвращает значение последнего параметра УчитыватьЗеркало.
//
// Возвращаемое значение:
//   Булево - Значение параметра последнего обращения к провайдеру.
Функция УчитыватьЗеркало() Экспорт

	Возврат _УчитыватьЗеркало;

КонецФункции

#КонецОбласти
